{"basics":{"name":"Juan Carcia","label":"Sr. Software Engineer","picture":"/assets/icons/icon.png","email":"juangarciazabaleta03@gmail.com","phone":"(567) 998-4411","summary":"I'm an aspiring inventor who seeks to learn something new every day.  I graduated the Universidad Francisco de Paula Santander of 2017 with a bachelors in Computer Engineering. <br><br>\n\nMy interests include web development trends, AI/ML technology, metaverse, cyber-security, internet of things, defense, consulting, and event organizing.  However, the list of all my passions extends much further.<br><br>\nMy dream job is to obtain a position where I can create new things to help better all the individuals around me.  If you're interested in someone with my skill-set, or would like to discuss something tech. related feel free to reach out.<br><br>  I'd love to talk. <br><br>\n[Download my Resume here](/assets/Juan.pdf)\n","location":{"address":"","postalCode":"132511","city":"Bolivar","countryCode":"Colombia","region":"San Mateo"},"profiles":[{"network":"Github","username":"davrona","url":"https://github.com/davrona"},{"network":"LinkedIn","username":"juan-camilo-carcia","url":"https://www.linkedin.com/in/juan-camilo-carcia/"},{"network":"Hackster","username":"Portfolio","url":""}]},"work":[{"company":"Nextant","position":"Software Engineer","website":"https://www.nextantaerospace.com/","startDate":"2019-03-04","endDate":"2023-08-24","summary":"Working on the Research and Development team at Nextant to provide state of the art technologies for AI product.\n","highlights":["Drove adoption of React inside the frontend team of Nextant, implemented the integration with the previous JS framework(Backbone.js) and working through migrating several parts of the main app.","Developed Nextant’s internal suite of React components and TypeScript libraries that built up company’s internal framework to quickly develop internal tools. The suite went from authentication to deployment, look and feel, and frontend comp","Developed, configured and deployed a variety of portals and UI Applications of PE using pure HTML, CSS and JavaScript.","Introduced a previously developed AI(GPT3.5/4) solution as a standalone SDK using React which led the acceleration of the development lifecycle.","Reduced the bridge communication between React and Native layer to increase the performance and worked on Search Engine Optimization.","Built several Service Tools for Nextant, such as monitoring and alert tool for Amazon Seller, copy-paste web manager, cookie switching extension, and a Zapier tool for integrating custom controls and populating fields.","Developed and deployed Nextant’s Solidity contracts on Ethereum blockchain using Node.js as well as a custom React frontend with Web3.js to publish and execute contracts on test and main networks.","Designed and implemented server-side REST APIs using Node.js and Express.js.","Leveraged expertise in Apollo GraphQL, React, D3.js and REST APIs to create insightful charts for clients that improved optimization and reduced loading times.","Worked on an MVP for niche protocol with Django REST framework, utilizing a proxy key signature scheme that was generated following the Schnorr signature algorithm on the EVM account’s underlying address private key.","Implemented automated payments with Stripe by creating a GraphQL endpoint that automatically calculates the amount owed to the user and pays them."]},{"company":"Revstar","position":"Software Engineer","website":"https://revstarconsulting.com/","startDate":"2017-10-15","endDate":"2019-03-15","summary":"Researched and covered different technologies that interest the revstar.\n","highlights":["Developed an airline pricing aggregator using React and Django. The application would query a number of different sources for typical air itineraries using a multi-threaded architecture and compile the results for human consumption.","Responsible for analyzing various cross-functional, multi-platform applications systems enforcing JavaScript best practices and provided guidance in making long term architectural design decisions.","Converted several applications to microservice architecture, communicating between services using REST APIs.","Boosted the core processing engine with an innovative and complex frontend of the order of 10,000 lines of code. Enabled it to sync a 10MB document in real-time between IndexedDB, multiple open browser tabs, and the server largely using RxJS.","Conducted the migration of the financial service to modern AWS architecture utilizing Lambda, AWS CDK, S3, API Gateway, and more.","Built multiple GraphQL endpoints on Hasura, as part of developing web-based application for in-app logic calculations. Used Django framework.","Worked on Revstar’s highly immersive Data Science CRM software involving Data Manipulation & Visualization, Web Scraping, UI, SQL, Unix Commands, MySQL and GraphQL.","For user accounts, utilized a JWT assisted ACL over GraphQL with a separate auth server Microservice, and implemented hardware wallet support.","Built CI pipeline with Jenkins, established engineering practices, and participated in the product definition with product managers and company directors at the client site.","Audited a complex Node.js React/Redux web application to identify security concerns and performance issues. Recommended steps to automate deployments in Azure and managed pull requests in Git."]}],"education":[{"institution":"Universidad Francisco de Paula Santander","area":"Systems Engineering","studyType":"Bachelor","startDate":"2015-06-01","endDate":"2017-06-01"},{"institution":"Universidad de Cantabria","area":"Spanish","studyType":"Exchange Student","startDate":"2014-06-01","endDate":"2014-12-01"},{"institution":"YCombinator","area":"Startup School","studyType":"Founding Engineer","startDate":"2023-04-30","endDate":"2023-10-01"}],"awards":[{"title":"Startup School","date":"2018-09-01","awarder":"YCombinator","summary":"Completed YCombinator's Startup School program on how to build a successful startup."}],"skills":[{"name":"Web Development","level":"Master","keywords":["HTML","CSS","Javascript","Typescript","TailwindCSS","Bootstrap","RESTful APIs","React","Vue.js","Backbone.js","Next.js","Flask","Django","Laravel","Webpack","Jest"]},{"name":"AI/ML","level":"Master","keywords":["Data Science","Pandas","NumPy","PyTorch","Scikit-learn","TensorFlow","Matplotlib","SciPy","NLP","OpenAI","R"]},{"name":"DB / DevOps","level":"Master","keywords":["AWS S3 / EC2 / DynamoDB / Lambda","GCP","Azure","Docker","PostgreSQL","MySQL","MongoDB","Cassandra"]},{"name":"Systems Engineering","level":"Master","keywords":["Electrical","Mechanical","OpenSCAD","IoT","Hardware"]}],"languages":[{"language":"Python","fluency":"Native speaker"},{"language":"Javascript","fluency":"Native speaker"},{"language":"PHP","fluency":"full-professional-proficiency"},{"language":"Java","fluency":"full-professional-proficiency"},{"language":"Ruby","fluency":"full-professional-proficiency"}],"interests":[{"name":"Metaverse","keywords":["Edge Computing","Blockchain","Computer Vision","Social Engineering"]},{"name":"Internet of Things","keywords":["Wireless Embeded Technology","NFC","4G-LTE","5G"]}]}
