


{
  "pages": [
    {
      
      
      
      "content": "\n",
      "url": "/404.html"
    },{
      
      "title": "Blog",
      "description": "The official Hydejack blog. Version updates, example content and how-to guides on how to blog with Jekyll.\n",
      "content": "\n",
      "url": "/blog/"
    },{
      "image": "/assets/img/hydejack-8.png",
      "title": "Hi there!",
      
      "content": "It is always tough to describe yourself, isn’t it? Anyway, I consider myself a nerdy geek let’s say, and a strong believer of sharing in all senses. That is why this Website exists actually.\n\nMy name is Juan Carcia, I’m an IT Nerd and this site is my open book where I express myself and share my ideas, experience and knowledge. I hope you find the material and content useful. Any feedback is always more than welcome. Enjoy your stay!\n\n\n  “Never look down on anybody unless you’re helping them up.”\n\n\nFeel Free to Explore\n\n\n  Projects — Assorted Web / Software projects.\n  Resume — Always open for amazing experiences.\n  Blog — Just a glimpse into my engineering career.\n\n\n",
      "url": "/"
    },{
      
      "title": "Posts",
      "description": "This is the list layout for showing blog posts, which shows just the title and groups them by year of publication. Check out the blog layout for comparison.\n",
      "content": "\n",
      "url": "/posts/"
    },{
      
      "title": "Projects",
      "description": "In this section you will find the most important and interested projects I took part of. Some of them could be in active development, other are just personal ones and last but not least, maybe some miscelaneous contributions.\n",
      "content": "\n",
      "url": "/projects/"
    },{
      
      "title": "Résumé",
      "description": "“I’m Juan Carcia and I hack &amp; design hardware &amp; web dev projects to try &amp; stand out in the crowd &amp; mentor the engineers of tomorrow”\n",
      "content": "\n",
      "url": "/resume/"
    },{
      
      "title": "Apache License",
      
      "content": "Version 2.0, January 2004\n\nhttp://www.apache.org/licenses/\n\nTERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n1. Definitions\n\n“License” shall mean the terms and conditions for use, reproduction,\nand distribution as defined by Sections 1 through 9 of this document.\n\n“Licensor” shall mean the copyright owner or entity authorized by\nthe copyright owner that is granting the License.\n\n“Legal Entity” shall mean the union of the acting entity and all\nother entities that control, are controlled by, or are under common\ncontrol with that entity. For the purposes of this definition,\n“control” means (i) the power, direct or indirect, to cause the\ndirection or management of such entity, whether by contract or\notherwise, or (ii) ownership of fifty percent (50%) or more of the\noutstanding shares, or (iii) beneficial ownership of such entity.\n\n“You” (or “Your”) shall mean an individual or Legal Entity\nexercising permissions granted by this License.\n\n“Source” form shall mean the preferred form for making modifications,\nincluding but not limited to software source code, documentation\nsource, and configuration files.\n\n“Object” form shall mean any form resulting from mechanical\ntransformation or translation of a Source form, including but\nnot limited to compiled object code, generated documentation,\nand conversions to other media types.\n\n“Work” shall mean the work of authorship, whether in Source or\nObject form, made available under the License, as indicated by a\ncopyright notice that is included in or attached to the work\n(an example is provided in the Appendix below).\n\n“Derivative Works” shall mean any work, whether in Source or Object\nform, that is based on (or derived from) the Work and for which the\neditorial revisions, annotations, elaborations, or other modifications\nrepresent, as a whole, an original work of authorship. For the purposes\nof this License, Derivative Works shall not include works that remain\nseparable from, or merely link (or bind by name) to the interfaces of,\nthe Work and Derivative Works thereof.\n\n“Contribution” shall mean any work of authorship, including\nthe original version of the Work and any modifications or additions\nto that Work or Derivative Works thereof, that is intentionally\nsubmitted to Licensor for inclusion in the Work by the copyright owner\nor by an individual or Legal Entity authorized to submit on behalf of\nthe copyright owner. For the purposes of this definition, “submitted”\nmeans any form of electronic, verbal, or written communication sent\nto the Licensor or its representatives, including but not limited to\ncommunication on electronic mailing lists, source code control systems,\nand issue tracking systems that are managed by, or on behalf of, the\nLicensor for the purpose of discussing and improving the Work, but\nexcluding communication that is conspicuously marked or otherwise\ndesignated in writing by the copyright owner as “Not a Contribution.”\n\n“Contributor” shall mean Licensor and any individual or Legal Entity\non behalf of whom a Contribution has been received by Licensor and\nsubsequently incorporated within the Work.\n\n2. Grant of Copyright License\nSubject to the terms and conditions of\nthis License, each Contributor hereby grants to You a perpetual,\nworldwide, non-exclusive, no-charge, royalty-free, irrevocable\ncopyright license to reproduce, prepare Derivative Works of,\npublicly display, publicly perform, sublicense, and distribute the\nWork and such Derivative Works in Source or Object form.\n\n3. Grant of Patent License\nSubject to the terms and conditions of\nthis License, each Contributor hereby grants to You a perpetual,\nworldwide, non-exclusive, no-charge, royalty-free, irrevocable\n(except as stated in this section) patent license to make, have made,\nuse, offer to sell, sell, import, and otherwise transfer the Work,\nwhere such license applies only to those patent claims licensable\nby such Contributor that are necessarily infringed by their\nContribution(s) alone or by combination of their Contribution(s)\nwith the Work to which such Contribution(s) was submitted. If You\ninstitute patent litigation against any entity (including a\ncross-claim or counterclaim in a lawsuit) alleging that the Work\nor a Contribution incorporated within the Work constitutes direct\nor contributory patent infringement, then any patent licenses\ngranted to You under this License for that Work shall terminate\nas of the date such litigation is filed.\n\n4. Redistribution\nYou may reproduce and distribute copies of the\nWork or Derivative Works thereof in any medium, with or without\nmodifications, and in Source or Object form, provided that You\nmeet the following conditions:\n\n\n  \n    You must give any other recipients of the Work or\nDerivative Works a copy of this License; and\n  \n  \n    You must cause any modified files to carry prominent notices\nstating that You changed the files; and\n  \n  \n    You must retain, in the Source form of any Derivative Works\nthat You distribute, all copyright, patent, trademark, and\nattribution notices from the Source form of the Work,\nexcluding those notices that do not pertain to any part of\nthe Derivative Works; and\n  \n  \n    If the Work includes a “NOTICE” text file as part of its\ndistribution, then any Derivative Works that You distribute must\ninclude a readable copy of the attribution notices contained\nwithin such NOTICE file, excluding those notices that do not\npertain to any part of the Derivative Works, in at least one\nof the following places: within a NOTICE text file distributed\nas part of the Derivative Works; within the Source form or\ndocumentation, if provided along with the Derivative Works; or,\nwithin a display generated by the Derivative Works, if and\nwherever such third-party notices normally appear. The contents\nof the NOTICE file are for informational purposes only and\ndo not modify the License. You may add Your own attribution\nnotices within Derivative Works that You distribute, alongside\nor as an addendum to the NOTICE text from the Work, provided\nthat such additional attribution notices cannot be construed\nas modifying the License.\n\n    You may add Your own copyright statement to Your modifications and\nmay provide additional or different license terms and conditions\nfor use, reproduction, or distribution of Your modifications, or\nfor any such Derivative Works as a whole, provided Your use,\nreproduction, and distribution of the Work otherwise complies with\nthe conditions stated in this License.\n  \n\n\n5. Submission of Contributions\nUnless You explicitly state otherwise,\nany Contribution intentionally submitted for inclusion in the Work\nby You to the Licensor shall be under the terms and conditions of\nthis License, without any additional terms or conditions.\nNotwithstanding the above, nothing herein shall supersede or modify\nthe terms of any separate license agreement you may have executed\nwith Licensor regarding such Contributions.\n\n6. Trademarks\nThis License does not grant permission to use the trade\nnames, trademarks, service marks, or product names of the Licensor,\nexcept as required for reasonable and customary use in describing the\norigin of the Work and reproducing the content of the NOTICE file.\n\n7. Disclaimer of Warranty\nUnless required by applicable law or\nagreed to in writing, Licensor provides the Work (and each\nContributor provides its Contributions) on an “AS IS” BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\nimplied, including, without limitation, any warranties or conditions\nof TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\nPARTICULAR PURPOSE. You are solely responsible for determining the\nappropriateness of using or redistributing the Work and assume any\nrisks associated with Your exercise of permissions under this License.\n\n8. Limitation of Liability\nIn no event and under no legal theory,\nwhether in tort (including negligence), contract, or otherwise,\nunless required by applicable law (such as deliberate and grossly\nnegligent acts) or agreed to in writing, shall any Contributor be\nliable to You for damages, including any direct, indirect, special,\nincidental, or consequential damages of any character arising as a\nresult of this License or out of the use or inability to use the\nWork (including but not limited to damages for loss of goodwill,\nwork stoppage, computer failure or malfunction, or any and all\nother commercial damages or losses), even if such Contributor\nhas been advised of the possibility of such damages.\n\n9. Accepting Warranty or Additional Liability\nWhile redistributing\nthe Work or Derivative Works thereof, You may choose to offer,\nand charge a fee for, acceptance of support, warranty, indemnity,\nor other liability obligations and/or rights consistent with this\nLicense. However, in accepting such obligations, You may act only\non Your own behalf and on Your sole responsibility, not on behalf\nof any other Contributor, and only if You agree to indemnify,\ndefend, and hold each Contributor harmless for any liability\n\nEND OF TERMS AND CONDITIONS\n\nAPPENDIX: How to apply the Apache License to your work\n\nTo apply the Apache License to your work, attach the following boilerplate\nnotice, with the fields enclosed by brackets [] replaced with your own\nidentifying information. (Don’t include the brackets!) The text should be\nenclosed in the appropriate comment syntax for the file format. We also\nrecommend that a file or class name and description of purpose be included on\nthe same “printed page” as the copyright notice for easier identification within\nthird-party archives.\n\nCopyright [yyyy] [name of copyright owner]\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n\n",
      "url": "/licenses/Apache-2.0/"
    },{
      
      "title": "GNU GENERAL PUBLIC LICENSE",
      
      "content": "Version 3, 29 June 2007\n\nCopyright (C) 2007 Free Software Foundation, Inc.\nhttp://fsf.org/\n\nEveryone is permitted to copy and distribute verbatim copies of this\nlicense document, but changing it is not allowed.\n\nPreamble\n\nThe GNU General Public License is a free, copyleft license for\nsoftware and other kinds of works.\n\nThe licenses for most software and other practical works are designed\nto take away your freedom to share and change the works. By contrast,\nthe GNU General Public License is intended to guarantee your freedom\nto share and change all versions of a program–to make sure it remains\nfree software for all its users. We, the Free Software Foundation, use\nthe GNU General Public License for most of our software; it applies\nalso to any other work released this way by its authors. You can apply\nit to your programs, too.\n\nWhen we speak of free software, we are referring to freedom, not\nprice. Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthem if you wish), that you receive source code or can get it if you\nwant it, that you can change the software or use pieces of it in new\nfree programs, and that you know you can do these things.\n\nTo protect your rights, we need to prevent others from denying you\nthese rights or asking you to surrender the rights. Therefore, you\nhave certain responsibilities if you distribute copies of the\nsoftware, or if you modify it: responsibilities to respect the freedom\nof others.\n\nFor example, if you distribute copies of such a program, whether\ngratis or for a fee, you must pass on to the recipients the same\nfreedoms that you received. You must make sure that they, too, receive\nor can get the source code. And you must show them these terms so they\nknow their rights.\n\nDevelopers that use the GNU GPL protect your rights with two steps:\n(1) assert copyright on the software, and (2) offer you this License\ngiving you legal permission to copy, distribute and/or modify it.\n\nFor the developers’ and authors’ protection, the GPL clearly explains\nthat there is no warranty for this free software. For both users’ and\nauthors’ sake, the GPL requires that modified versions be marked as\nchanged, so that their problems will not be attributed erroneously to\nauthors of previous versions.\n\nSome devices are designed to deny users access to install or run\nmodified versions of the software inside them, although the\nmanufacturer can do so. This is fundamentally incompatible with the\naim of protecting users’ freedom to change the software. The\nsystematic pattern of such abuse occurs in the area of products for\nindividuals to use, which is precisely where it is most unacceptable.\nTherefore, we have designed this version of the GPL to prohibit the\npractice for those products. If such problems arise substantially in\nother domains, we stand ready to extend this provision to those\ndomains in future versions of the GPL, as needed to protect the\nfreedom of users.\n\nFinally, every program is threatened constantly by software patents.\nStates should not allow patents to restrict development and use of\nsoftware on general-purpose computers, but in those that do, we wish\nto avoid the special danger that patents applied to a free program\ncould make it effectively proprietary. To prevent this, the GPL\nassures that patents cannot be used to render the program non-free.\n\nThe precise terms and conditions for copying, distribution and\nmodification follow.\n\nTERMS AND CONDITIONS\n\n0. Definitions\n\n“This License” refers to version 3 of the GNU General Public License.\n\n“Copyright” also means copyright-like laws that apply to other kinds\nof works, such as semiconductor masks.\n\n“The Program” refers to any copyrightable work licensed under this\nLicense. Each licensee is addressed as “you”. “Licensees” and\n“recipients” may be individuals or organizations.\n\nTo “modify” a work means to copy from or adapt all or part of the work\nin a fashion requiring copyright permission, other than the making of\nan exact copy. The resulting work is called a “modified version” of\nthe earlier work or a work “based on” the earlier work.\n\nA “covered work” means either the unmodified Program or a work based\non the Program.\n\nTo “propagate” a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it on a\ncomputer or modifying a private copy. Propagation includes copying,\ndistribution (with or without modification), making available to the\npublic, and in some countries other activities as well.\n\nTo “convey” a work means any kind of propagation that enables other\nparties to make or receive copies. Mere interaction with a user\nthrough a computer network, with no transfer of a copy, is not\nconveying.\n\nAn interactive user interface displays “Appropriate Legal Notices” to\nthe extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to the\nextent that warranties are provided), that licensees may convey the\nwork under this License, and how to view a copy of this License. If\nthe interface presents a list of user commands or options, such as a\nmenu, a prominent item in the list meets this criterion.\n\n1. Source Code\n\nThe “source code” for a work means the preferred form of the work for\nmaking modifications to it. “Object code” means any non-source form of\na work.\n\nA “Standard Interface” means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case of\ninterfaces specified for a particular programming language, one that\nis widely used among developers working in that language.\n\nThe “System Libraries” of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form of\npackaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form. A\n“Major Component”, in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.\n\nThe “Corresponding Source” for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts to\ncontrol those activities. However, it does not include the work’s\nSystem Libraries, or general-purpose tools or generally available free\nprograms which are used unmodified in performing those activities but\nwhich are not part of the work. For example, Corresponding Source\nincludes interface definition files associated with source files for\nthe work, and the source code for shared libraries and dynamically\nlinked subprograms that the work is specifically designed to require,\nsuch as by intimate data communication or control flow between those\nsubprograms and other parts of the work.\n\nThe Corresponding Source need not include anything that users can\nregenerate automatically from other parts of the Corresponding Source.\n\nThe Corresponding Source for a work in source code form is that same\nwork.\n\n2. Basic Permissions\n\nAll rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met. This License explicitly affirms your unlimited\npermission to run the unmodified Program. The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work. This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.\n\nYou may make, run and propagate covered works that you do not convey,\nwithout conditions so long as your license otherwise remains in force.\nYou may convey covered works to others for the sole purpose of having\nthem make modifications exclusively for you, or provide you with\nfacilities for running those works, provided that you comply with the\nterms of this License in conveying all material for which you do not\ncontrol copyright. Those thus making or running the covered works for\nyou must do so exclusively on your behalf, under your direction and\ncontrol, on terms that prohibit them from making any copies of your\ncopyrighted material outside their relationship with you.\n\nConveying under any other circumstances is permitted solely under the\nconditions stated below. Sublicensing is not allowed; section 10 makes\nit unnecessary.\n\n3. Protecting Users’ Legal Rights From Anti-Circumvention Law\n\nNo covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such\nmeasures.\n\nWhen you convey a covered work, you waive any legal power to forbid\ncircumvention of technological measures to the extent such\ncircumvention is effected by exercising rights under this License with\nrespect to the covered work, and you disclaim any intention to limit\noperation or modification of the work as a means of enforcing, against\nthe work’s users, your or third parties’ legal rights to forbid\ncircumvention of technological measures.\n\n4. Conveying Verbatim Copies\n\nYou may convey verbatim copies of the Program’s source code as you\nreceive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice;\nkeep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the code;\nkeep intact all notices of the absence of any warranty; and give all\nrecipients a copy of this License along with the Program.\n\nYou may charge any price or no price for each copy that you convey,\nand you may offer support or warranty protection for a fee.\n\n5. Conveying Modified Source Versions\n\nYou may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the\nterms of section 4, provided that you also meet all of these\nconditions:\n\n\n  The work must carry prominent notices stating that you modified\nit, and giving a relevant date.\n  The work must carry prominent notices stating that it is\nreleased under this License and any conditions added under\nsection 7. This requirement modifies the requirement in section 4\nto “keep intact all notices”.\n  You must license the entire work, as a whole, under this\nLicense to anyone who comes into possession of a copy. This\nLicense will therefore apply, along with any applicable section 7\nadditional terms, to the whole of the work, and all its parts,\nregardless of how they are packaged. This License gives no\npermission to license the work in any other way, but it does not\ninvalidate such permission if you have separately received it.\n  If the work has interactive user interfaces, each must display\nAppropriate Legal Notices; however, if the Program has interactive\ninterfaces that do not display Appropriate Legal Notices, your\nwork need not make them do so.\n\n\nA compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered work,\nand which are not combined with it such as to form a larger program,\nin or on a volume of a storage or distribution medium, is called an\n“aggregate” if the compilation and its resulting copyright are not\nused to limit the access or legal rights of the compilation’s users\nbeyond what the individual works permit. Inclusion of a covered work\nin an aggregate does not cause this License to apply to the other\nparts of the aggregate.\n\n6. Conveying Non-Source Forms\n\nYou may convey a covered work in object code form under the terms of\nsections 4 and 5, provided that you also convey the machine-readable\nCorresponding Source under the terms of this License, in one of these\nways:\n\n\n  Convey the object code in, or embodied in, a physical product\n(including a physical distribution medium), accompanied by the\nCorresponding Source fixed on a durable physical medium\ncustomarily used for software interchange.\n  Convey the object code in, or embodied in, a physical product\n(including a physical distribution medium), accompanied by a\nwritten offer, valid for at least three years and valid for as\nlong as you offer spare parts or customer support for that product\nmodel, to give anyone who possesses the object code either (1) a\ncopy of the Corresponding Source for all the software in the\nproduct that is covered by this License, on a durable physical\nmedium customarily used for software interchange, for a price no\nmore than your reasonable cost of physically performing this\nconveying of source, or (2) access to copy the Corresponding\nSource from a network server at no charge.\n  Convey individual copies of the object code with a copy of the\nwritten offer to provide the Corresponding Source. This\nalternative is allowed only occasionally and noncommercially, and\nonly if you received the object code with such an offer, in accord\nwith subsection 6b.\n  Convey the object code by offering access from a designated\nplace (gratis or for a charge), and offer equivalent access to the\nCorresponding Source in the same way through the same place at no\nfurther charge. You need not require recipients to copy the\nCorresponding Source along with the object code. If the place to\ncopy the object code is a network server, the Corresponding Source\nmay be on a different server (operated by you or a third party)\nthat supports equivalent copying facilities, provided you maintain\nclear directions next to the object code saying where to find the\nCorresponding Source. Regardless of what server hosts the\nCorresponding Source, you remain obligated to ensure that it is\navailable for as long as needed to satisfy these requirements.\n  Convey the object code using peer-to-peer transmission,\nprovided you inform other peers where the object code and\nCorresponding Source of the work are being offered to the general\npublic at no charge under subsection 6d.\n\n\nA separable portion of the object code, whose source code is excluded\nfrom the Corresponding Source as a System Library, need not be\nincluded in conveying the object code work.\n\nA “User Product” is either (1) a “consumer product”, which means any\ntangible personal property which is normally used for personal,\nfamily, or household purposes, or (2) anything designed or sold for\nincorporation into a dwelling. In determining whether a product is a\nconsumer product, doubtful cases shall be resolved in favor of\ncoverage. For a particular product received by a particular user,\n“normally used” refers to a typical or common use of that class of\nproduct, regardless of the status of the particular user or of the way\nin which the particular user actually uses, or expects or is expected\nto use, the product. A product is a consumer product regardless of\nwhether the product has substantial commercial, industrial or\nnon-consumer uses, unless such uses represent the only significant\nmode of use of the product.\n\n“Installation Information” for a User Product means any methods,\nprocedures, authorization keys, or other information required to\ninstall and execute modified versions of a covered work in that User\nProduct from a modified version of its Corresponding Source. The\ninformation must suffice to ensure that the continued functioning of\nthe modified object code is in no case prevented or interfered with\nsolely because modification has been made.\n\nIf you convey an object code work under this section in, or with, or\nspecifically for use in, a User Product, and the conveying occurs as\npart of a transaction in which the right of possession and use of the\nUser Product is transferred to the recipient in perpetuity or for a\nfixed term (regardless of how the transaction is characterized), the\nCorresponding Source conveyed under this section must be accompanied\nby the Installation Information. But this requirement does not apply\nif neither you nor any third party retains the ability to install\nmodified object code on the User Product (for example, the work has\nbeen installed in ROM).\n\nThe requirement to provide Installation Information does not include a\nrequirement to continue to provide support service, warranty, or\nupdates for a work that has been modified or installed by the\nrecipient, or for the User Product in which it has been modified or\ninstalled. Access to a network may be denied when the modification\nitself materially and adversely affects the operation of the network\nor violates the rules and protocols for communication across the\nnetwork.\n\nCorresponding Source conveyed, and Installation Information provided,\nin accord with this section must be in a format that is publicly\ndocumented (and with an implementation available to the public in\nsource code form), and must require no special password or key for\nunpacking, reading or copying.\n\n7. Additional Terms\n\n“Additional permissions” are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program shall\nbe treated as though they were included in this License, to the extent\nthat they are valid under applicable law. If additional permissions\napply only to part of the Program, that part may be used separately\nunder those permissions, but the entire Program remains governed by\nthis License without regard to the additional permissions.\n\nWhen you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part of\nit. (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.) You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.\n\nNotwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders\nof that material) supplement the terms of this License with terms:\n\n\n  Disclaiming warranty or limiting liability differently from the\nterms of sections 15 and 16 of this License; or\n  Requiring preservation of specified reasonable legal notices or\nauthor attributions in that material or in the Appropriate Legal\nNotices displayed by works containing it; or\n  Prohibiting misrepresentation of the origin of that material,\nor requiring that modified versions of such material be marked in\nreasonable ways as different from the original version; or\n  Limiting the use for publicity purposes of names of licensors\nor authors of the material; or\n  Declining to grant rights under trademark law for use of some\ntrade names, trademarks, or service marks; or\n  Requiring indemnification of licensors and authors of that\nmaterial by anyone who conveys the material (or modified versions\nof it) with contractual assumptions of liability to the recipient,\nfor any liability that these contractual assumptions directly\nimpose on those licensors and authors.\n\n\nAll other non-permissive additional terms are considered “further\nrestrictions” within the meaning of section 10. If the Program as you\nreceived it, or any part of it, contains a notice stating that it is\ngoverned by this License along with a term that is a further\nrestriction, you may remove that term. If a license document contains\na further restriction but permits relicensing or conveying under this\nLicense, you may add to a covered work material governed by the terms\nof that license document, provided that the further restriction does\nnot survive such relicensing or conveying.\n\nIf you add terms to a covered work in accord with this section, you\nmust place, in the relevant source files, a statement of the\nadditional terms that apply to those files, or a notice indicating\nwhere to find the applicable terms.\n\nAdditional terms, permissive or non-permissive, may be stated in the\nform of a separately written license, or stated as exceptions; the\nabove requirements apply either way.\n\n8. Termination\n\nYou may not propagate or modify a covered work except as expressly\nprovided under this License. Any attempt otherwise to propagate or\nmodify it is void, and will automatically terminate your rights under\nthis License (including any patent licenses granted under the third\nparagraph of section 11).\n\nHowever, if you cease all violation of this License, then your license\nfrom a particular copyright holder is reinstated (a) provisionally,\nunless and until the copyright holder explicitly and finally\nterminates your license, and (b) permanently, if the copyright holder\nfails to notify you of the violation by some reasonable means prior to\n60 days after the cessation.\n\nMoreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you of the\nviolation by some reasonable means, this is the first time you have\nreceived notice of violation of this License (for any work) from that\ncopyright holder, and you cure the violation prior to 30 days after\nyour receipt of the notice.\n\nTermination of your rights under this section does not terminate the\nlicenses of parties who have received copies or rights from you under\nthis License. If your rights have been terminated and not permanently\nreinstated, you do not qualify to receive new licenses for the same\nmaterial under section 10.\n\n9. Acceptance Not Required for Having Copies\n\nYou are not required to accept this License in order to receive or run\na copy of the Program. Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance. However,\nnothing other than this License grants you permission to propagate or\nmodify any covered work. These actions infringe copyright if you do\nnot accept this License. Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.\n\n10. Automatic Licensing of Downstream Recipients\n\nEach time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License. You are not responsible\nfor enforcing compliance by third parties with this License.\n\nAn “entity transaction” is a transaction transferring control of an\norganization, or substantially all assets of one, or subdividing an\norganization, or merging organizations. If propagation of a covered\nwork results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party’s predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest, if\nthe predecessor has it or can get it with reasonable efforts.\n\nYou may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License. For example, you may\nnot impose a license fee, royalty, or other charge for exercise of\nrights granted under this License, and you may not initiate litigation\n(including a cross-claim or counterclaim in a lawsuit) alleging that\nany patent claim is infringed by making, using, selling, offering for\nsale, or importing the Program or any portion of it.\n\n11. Patents\n\nA “contributor” is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based. The\nwork thus licensed is called the contributor’s “contributor version”.\n\nA contributor’s “essential patent claims” are all patent claims owned\nor controlled by the contributor, whether already acquired or\nhereafter acquired, that would be infringed by some manner, permitted\nby this License, of making, using, or selling its contributor version,\nbut do not include claims that would be infringed only as a\nconsequence of further modification of the contributor version. For\npurposes of this definition, “control” includes the right to grant\npatent sublicenses in a manner consistent with the requirements of\nthis License.\n\nEach contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor’s essential patent claims, to\nmake, use, sell, offer for sale, import and otherwise run, modify and\npropagate the contents of its contributor version.\n\nIn the following three paragraphs, a “patent license” is any express\nagreement or commitment, however denominated, not to enforce a patent\n(such as an express permission to practice a patent or covenant not to\nsue for patent infringement). To “grant” such a patent license to a\nparty means to make such an agreement or commitment not to enforce a\npatent against the party.\n\nIf you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through a\npublicly available network server or other readily accessible means,\nthen you must either (1) cause the Corresponding Source to be so\navailable, or (2) arrange to deprive yourself of the benefit of the\npatent license for this particular work, or (3) arrange, in a manner\nconsistent with the requirements of this License, to extend the patent\nlicense to downstream recipients. “Knowingly relying” means you have\nactual knowledge that, but for the patent license, your conveying the\ncovered work in a country, or your recipient’s use of the covered work\nin a country, would infringe one or more identifiable patents in that\ncountry that you have reason to believe are valid.\n\nIf, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance of, a\ncovered work, and grant a patent license to some of the parties\nreceiving the covered work authorizing them to use, propagate, modify\nor convey a specific copy of the covered work, then the patent license\nyou grant is automatically extended to all recipients of the covered\nwork and works based on it.\n\nA patent license is “discriminatory” if it does not include within the\nscope of its coverage, prohibits the exercise of, or is conditioned on\nthe non-exercise of one or more of the rights that are specifically\ngranted under this License. You may not convey a covered work if you\nare a party to an arrangement with a third party that is in the\nbusiness of distributing software, under which you make payment to the\nthird party based on the extent of your activity of conveying the\nwork, and under which the third party grants, to any of the parties\nwho would receive the covered work from you, a discriminatory patent\nlicense (a) in connection with copies of the covered work conveyed by\nyou (or copies made from those copies), or (b) primarily for and in\nconnection with specific products or compilations that contain the\ncovered work, unless you entered into that arrangement, or that patent\nlicense was granted, prior to 28 March 2007.\n\nNothing in this License shall be construed as excluding or limiting\nany implied license or other defenses to infringement that may\notherwise be available to you under applicable patent law.\n\n12. No Surrender of Others’ Freedom\n\nIf conditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License. If you cannot convey a\ncovered work so as to satisfy simultaneously your obligations under\nthis License and any other pertinent obligations, then as a\nconsequence you may not convey it at all. For example, if you agree to\nterms that obligate you to collect a royalty for further conveying\nfrom those to whom you convey the Program, the only way you could\nsatisfy both those terms and this License would be to refrain entirely\nfrom conveying the Program.\n\n13. Use with the GNU Affero General Public License\n\nNotwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU Affero General Public License into a single\ncombined work, and to convey the resulting work. The terms of this\nLicense will continue to apply to the part which is the covered work,\nbut the special requirements of the GNU Affero General Public License,\nsection 13, concerning interaction through a network will apply to the\ncombination as such.\n\n14. Revised Versions of this License\n\nThe Free Software Foundation may publish revised and/or new versions\nof the GNU General Public License from time to time. Such new versions\nwill be similar in spirit to the present version, but may differ in\ndetail to address new problems or concerns.\n\nEach version is given a distinguishing version number. If the Program\nspecifies that a certain numbered version of the GNU General Public\nLicense “or any later version” applies to it, you have the option of\nfollowing the terms and conditions either of that numbered version or\nof any later version published by the Free Software Foundation. If the\nProgram does not specify a version number of the GNU General Public\nLicense, you may choose any version ever published by the Free\nSoftware Foundation.\n\nIf the Program specifies that a proxy can decide which future versions\nof the GNU General Public License can be used, that proxy’s public\nstatement of acceptance of a version permanently authorizes you to\nchoose that version for the Program.\n\nLater license versions may give you additional or different\npermissions. However, no additional obligations are imposed on any\nauthor or copyright holder as a result of your choosing to follow a\nlater version.\n\n15. Disclaimer of Warranty\n\nTHERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW. EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM “AS IS” WITHOUT\nWARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY AND\nPERFORMANCE OF THE PROGRAM IS WITH YOU. SHOULD THE PROGRAM PROVE\nDEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR\nCORRECTION.\n\n16. Limitation of Liability\n\nIN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR\nCONVEYS THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES\nARISING OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT\nNOT LIMITED TO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR\nLOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM\nTO OPERATE WITH ANY OTHER PROGRAMS), EVEN IF SUCH HOLDER OR OTHER\nPARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n17. Interpretation of Sections 15 and 16\n\nIf the disclaimer of warranty and limitation of liability provided\nabove cannot be given local legal effect according to their terms,\nreviewing courts shall apply local law that most closely approximates\nan absolute waiver of all civil liability in connection with the\nProgram, unless a warranty or assumption of liability accompanies a\ncopy of the Program in return for a fee.\n",
      "url": "/licenses/GPL-3.0/"
    },{
      
      "title": "MIT License",
      
      "content": "Copyright (c) &lt;YEAR&gt; &lt;COPYRIGHT HOLDER&gt;\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the “Software”), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n",
      "url": "/licenses/MIT/"
    },{
      
      "title": "PRO License",
      
      "content": "\n  License Summary\n  Terms and Conditions    \n      1. Preamble\n      2. License Grant\n      3. Term &amp; Termination:\n      4. Payment\n      5. Upgrades, Updates and Fixes\n      6. Support\n      7. Liability\n      8. Warranty\n      9. No Refunds\n      10. Indemnification\n      11. Governing Law, Jurisdiction\n    \n  \n\n\nLicense Summary\n\n  License concerns use of Hydejack PRO\n  License does not expire\n  Commercial use allowed\n  Can modify source code\n  Parts of software are provided under separate licenses\n\n\nTerms and Conditions\n1. Preamble\nThis Agreement governs the relationship between you (hereinafter: Licensee) and\nFlorian Klampfer qwtel.com (hereinafter: Licensor).\nThis Agreement sets the terms, rights, restrictions and obligations on using\nHydejack PRO (hereinafter: The Software)\ncreated and owned by Licensor, as detailed herein.\n\n2. License Grant\nLicensor hereby grants Licensee a Personal, Perpetual, Commercial, Royalty free,\nIncluding the rights to create derivative works, Non-exclusive license, all with accordance with\nthe terms set forth and other legal restrictions set forth in 3rd party software used while running Software.\n\n\n  \n    Limited: Licensee may use Software for the purpose of:\n\n    \n      Running Software on Licensee’s Website[s] and Server[s];\n      Allowing 3rd Parties to run Software on Licensee’s Website[s] and Server[s];\n      Publishing Software’s output to Licensee and 3rd Parties;\n      Modify Software to suit Licensee’s needs and specifications.\n    \n  \n  \n    This license is granted perpetually, as long as you do not materially breach it.\n  \n  \n    Commercial, Royalty Free: Licensee may use Software for any purpose, including paid-services, without any\nroyalties\n  \n  \n    Including the Right to Create Derivative Works: Licensee may create derivative works based on Software,\nincluding amending Software’s source code, modifying it, integrating it into a larger work or removing portions of\nSoftware.\n  \n\n\n3. Term &amp; Termination:\nThe Term of this license shall be until terminated. Licensor may terminate this Agreement,\nincluding Licensee’s license in the case where Licensee:\n\n\n  became insolvent or otherwise entered into any liquidation process; or\n  exported The Software to any jurisdiction where licensor may not enforce his rights under this agreements in; or\n  Licensee was in breach of any of this license’s terms and conditions and such breach was not cured, immediately\nupon notification; or\n  Licensee in breach of any of the terms of clause 2 to this license; or\n  Licensee otherwise entered into any arrangement which caused Licensor to be unable to enforce his rights under\nthis License.\n\n\n4. Payment\nIn consideration of the License granted under clause 2, Licensee shall pay Licensor a fee, via\nCredit-Card or any other means which Licensor may deem adequate. Failure to perform payment shall construe as\nmaterial breach of this Agreement.\n\n5. Upgrades, Updates and Fixes\nLicensor may provide Licensee, from time to time, with Upgrades, Updates or Fixes,\nas detailed herein and according to his sole discretion. Licensee hereby warrants to keep The Software up-to-date\nand install all relevant updates and fixes, and may, at his sole discretion, purchase upgrades, according to the\nrates set by Licensor. Licensor shall provide any update or Fix free of charge; however, nothing in this Agreement\nshall require Licensor to provide Updates or Fixes.\n\n\n  \n    Upgrades: for the purpose of this license, an Upgrade shall be a material amendment in The Software, which\ncontains new features and or major performance improvements and shall be marked as a new version number. For\nexample, should Licensee purchase The Software under version 1.X.X, an upgrade shall commence under number\n2.0.0.\n  \n  \n    Updates: for the purpose of this license, an update shall be a minor amendment in The Software, which may\ncontain new features or minor improvements and shall be marked as a new sub-version number. For example, should\nLicensee purchase The Software under version 1.1.X, an upgrade shall commence under number 1.2.0.\n  \n  \n    Fix: for the purpose of this license, a fix shall be a minor amendment in The Software, intended to remove\nbugs or alter minor features which impair the The Software’s functionality. A fix shall be marked as a new\nsub-sub-version number. For example, should Licensee purchase Software under version 1.1.1, an upgrade shall\ncommence under number 1.1.2.\n  \n\n\n6. Support\nSoftware is provided under an AS-IS basis and without any support, updates or maintenance. Nothing in\nthis Agreement shall require Licensor to provide Licensee with support or fixes to any bug, failure,\nmis-performance or other defect in The Software.\n\n\n  \n    Bug Notification: Licensee may provide Licensor of details regarding any bug, defect or failure in The\nSoftware promptly and with no delay from such event; Licensee shall comply with Licensor’s request for\ninformation regarding bugs, defects or failures and furnish him with information, screenshots and try to\nreproduce such bugs, defects or failures.\n  \n  \n    Feature Request: Licensee may request additional features in Software, provided, however, that:\n\n    \n      Licensee shall waive any claim or right in such feature should feature be developed by Licensor;\n      Licensee shall be prohibited from developing the feature, or disclose such feature request, or feature, to\nany 3rd party directly competing with Licensor or any 3rd party which may be, following the development of\nsuch feature, in direct competition with Licensor;\n      Licensee warrants that feature does not infringe any 3rd party patent, trademark, trade-secret or any other\nintellectual property right; and\n      Licensee developed, envisioned or created the feature solely by himself.\n    \n  \n\n\n7. Liability\nTo the extent permitted under Law, The Software is provided under an AS-IS basis. Licensor shall\nnever, and without any limit, be liable for any damage, cost, expense or any other payment incurred by Licensee as\na result of Software’s actions, failure, bugs and/or any other interaction between The Software and Licensee’s\nend-equipment, computers, other software or any 3rd party, end-equipment, computer or services. Moreover, Licensor\nshall never be liable for any defect in source code written by Licensee when relying on The Software or using The\nSoftware’s source code.\n\n8. Warranty\n\n  \n    No-Warranty: The Software is provided without any warranty; Licensor hereby disclaims any warranty that The\nSoftware shall be error free, without defects or code which may cause damage to Licensee’s computers or to\nLicensee, and that Software shall be functional. Licensee shall be solely liable to any damage, defect or loss\nincurred as a result of operating software and undertake the risks contained in running The Software on\nLicense’s Server[s] and Website[s].\n  \n  \n    Prior Inspection: Licensee hereby states that he inspected The Software thoroughly and found it\nsatisfactory and adequate to his needs, that it does not interfere with his regular operation and that it does\nmeet the standards and scope of his computer systems and architecture. Licensee found that The Software\ninteracts with his development, website and server environment and that it does not infringe any of End User\nLicense Agreement of any software Licensee may use in performing his services. Licensee hereby waives any\nclaims regarding The Software’s incompatibility, performance, results and features, and warrants that he\ninspected the The Software.\n  \n\n\n9. No Refunds\nLicensee warrants that he inspected The Software according to clause 8.2 and that it is adequate to\nhis needs. Accordingly, as The Software is intangible goods, Licensee shall not be, ever, entitled to any refund,\nrebate, compensation or restitution for any reason whatsoever, even if The Software contains material flaws.\n\n10. Indemnification\nLicensee hereby warrants to hold Licensor harmless and indemnify Licensor for any lawsuit\nbrought against it in regards to Licensee’s use of The Software in means that violate, breach or otherwise\ncircumvent this license, Licensor’s intellectual property rights or Licensor’s title in The Software. Licensor\nshall promptly notify Licensee in case of such legal action and request Licensee’s consent prior to any settlement\nin relation to such lawsuit or claim.\n\n11. Governing Law, Jurisdiction\nLicensee hereby agrees not to initiate class-action lawsuits against Licensor in\nrelation to this license and to compensate Licensor for any legal fees, cost or attorney fees should any claim\nbrought by Licensee against Licensor be denied, in part or in full.\n\n",
      "url": "/licenses/PRO/"
    },{
      
      "title": "W3C SOFTWARE NOTICE AND LICENSE",
      
      "content": "Status: This license takes effect 13 May, 2015.\n\nThis work is being provided by the copyright holders under the following license.\n\nLicense\n\nBy obtaining and/or copying this work, you (the licensee) agree that you have read, understood, and will comply with the following terms and conditions.\n\nPermission to copy, modify, and distribute this work, with or without modification, for any purpose and without fee or royalty is hereby granted, provided that you include the following on ALL copies of the work or portions thereof, including modifications:\n\n\n  The full text of this NOTICE in a location viewable to users of the redistributed or derivative work.\n  Any pre-existing intellectual property disclaimers, notices, or terms and conditions. If none exist, the W3C Software and Document Short Notice should be included.\n  Notice of any changes or modifications, through a copyright statement on the new code or document such as “This software or document includes material copied from or derived from [title and URI of the W3C document]. Copyright © [YEAR] W3C® (MIT, ERCIM, Keio, Beihang).”\n\n\nDisclaimers\n\nTHIS WORK IS PROVIDED “AS IS,” AND COPYRIGHT HOLDERS MAKE NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY OR FITNESS FOR ANY PARTICULAR PURPOSE OR THAT THE USE OF THE SOFTWARE OR DOCUMENT WILL NOT INFRINGE ANY THIRD PARTY PATENTS, COPYRIGHTS, TRADEMARKS OR OTHER RIGHTS.\n\nCOPYRIGHT HOLDERS WILL NOT BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF ANY USE OF THE SOFTWARE OR DOCUMENT.\n\nThe name and trademarks of copyright holders may NOT be used in advertising or publicity pertaining to the work without specific, written prior permission. Title to copyright in this work will at all times remain with copyright holders.\n\nNotes\n\nThis version: http://www.w3.org/Consortium/Legal/2015/copyright-software-and-document\n\nPrevious version: http://www.w3.org/Consortium/Legal/2002/copyright-software-20021231\n\nThis version makes clear that the license is applicable to both software and text, by changing the name and substituting “work” for instances of “software and its documentation.” It moves “notice of changes or modifications to the files” to the copyright notice, to make clear that the license is compatible with other liberal licenses.\n",
      "url": "/licenses/W3C-20150513/"
    },{
      
      "title": "Licenses",
      
      "content": "Open Source\n\n  Apache-2.0\n  GPL-3.0\n  MIT\n  W3C-20150513\n\n\nCustom\n\n  PRO\n\n",
      "url": "/licenses/"
    },{
      
      "title": "Blog",
      "description": "The official Hydejack blog. Version updates, example content and how-to guides on how to blog with Jekyll.\n",
      "content": "\n",
      "url": "/blog/2/"
    },{
      
      "title": "Blog",
      "description": "The official Hydejack blog. Version updates, example content and how-to guides on how to blog with Jekyll.\n",
      "content": "\n",
      "url": "/blog/3/"
    }
  ], 
  "documents": [
    {
      "image": "/assets/img/blog/HackConV.png",
      "title": "HackCon V Lightning Talks",
      "date": "2017-09-12 00:00:00 -0400",
      "description": "I gave a talk at HackCon V!\n",
      "content": "In December of 2015 I joined an organization called Major League Hacking.\n\nMajor League Hacking (MLH) is the official student hackathon league. Each year, we power over 200 weekend-long invention competitions that inspire innovation, cultivate communities and teach computer science skills to more than 65,000 students around the world. MLH is an engaged and passionate maker community, consisting of the next generation of technology leaders and entrepreneurs.\n\n\n\nI joined MLH as a Coach.\n\n\n\nMajor League Hacking Coaches are community members who represent Major League Hacking at events. Coaches are the people you want at every hackathon. They are passionate hackers and community members who love to teach and support peers of all skill levels. MLH Coaches are at your events mentoring hackers and supporting organizers. They can be found debugging your code in the middle of the night, ensuring judging goes smoothly, or even taking out the trash (both literally and figuratively). Coaches are hackathon superheroes, without the capes, masks and lassos of truth.\n\nI wanted to let the community know more about the Coaches program and how we can be useful to them so I gave a talk at HackCon V about how to handle event managing and how to best utilize the Coaches present at the events.\nGave a talk at HackCon V about how to handle event managing.\n\nUsed analogies about how event coordinators are firefighters.\n\n\n",
      "categories": ["public_speaking"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/public_speaking/2017-09-12-hackconV/"
    },{
      "image": {"path":"/assets/img/blog/cyberfire.png"},
      "title": "Won Cyber Fire CTF 2017",
      "date": "2017-11-18 00:00:00 -0500",
      "description": "A how-to article for creating an ecosystem to monitor your house plants.\n",
      "content": "CyberFire events are led by expert security investigators from United States Department of Energy National Laboratories. Our instructors have performed cybersecurity investigation and research continuously since 2005. Every year they hold a Capture The Flag (CTF) event at their various trainings. This year my team and I took home first place! There was no prize for winning, but it felt great to compete with other skilled cybersecurity proffesionals!\n",
      "categories": ["publications"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/publications/2017-11-18-we-won-cyberfire/"
    },{
      "image": {"path":"/assets/img/projects/project-icarus.gif"},
      "title": "Alexa, Attack Intruders",
      "date": "2018-05-08 00:00:00 -0400",
      "description": "Article about my Alexa enabled Nerf Gun Turret.\n",
      "content": "Spent about 2 months making a fun and safe Alexa enabled Nerf Gun Turret and published the instructions to create it it back in May 2018.\n\nIt recieved a lot of great praise and my favorite Hacker website Hackaday decided a publish a story on it.\n",
      "categories": ["publications"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/publications/2018-05-08-alexa-attack-intruders/"
    },{
      "image": {"path":"https://ph-files.imgix.net/5e5200be-9595-4417-8e61-ec66edae1269?auto=format&auto=compress&codec=mozjpeg&cs=strip"},
      "title": "How To Learn to Code With Flashcards for Developers",
      "date": "2018-10-02 00:00:00 -0400",
      "description": "Interview on the beginnings of Flashcards for Developers\n",
      "content": "Flashcards for Developers is a site that creates curated list of flashcards to boost your professional developer skills.\n\nI spent about 6 months co-founding this webapp with my dear friend and talented co-founder NikoLazaris. This is just one of the many interviews we did about our product.\n\n\n",
      "categories": ["publications"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/publications/2018-10-02-how-to-flashcards-for-developers/"
    },{
      "image": "/assets/img/blog/StartupSchool.png",
      "title": "YCombinator Startup School",
      "date": "2018-11-10 00:00:00 -0500",
      "description": "Graduated YCombinator’s Startup School\n",
      "content": "Startup School is a free, 10-week, online course. It’s designed for any startup founder who would like to get help through the earliest, most difficult challenges of starting a company.\n\n\n\nNiko Lazaris and I applied to YCombinator’s Startup School August 2018 and we got accepted. We worked heavily on Flashcards for Developers during that time and learned several invaluable lessons through the process.\n\nAnd after 10 stressful weeks we obtained our certificate.\n",
      "categories": ["certifications"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/certifications/2018-11-10-yCombinator-Startup-School/"
    },{
      "image": {"path":"/assets/img/blog/clarifai-medium.png"},
      "title": "Powering Applications with Image Classification",
      "date": "2018-11-27 00:00:00 -0500",
      "description": "Wrote a Medium Article about Image Classification using Clarifai.\n",
      "content": "Towards the end of my Coaching career with Major League Hacking they introduced a technical writing aspect to the job.\n\nYou could write a technical piece about how to recreate a Hackathon project or even improve on a hackathon project and publish it through their Medium platform.\n\nI decided to spend time writing my first Medium article about how to make an image classification application in a few simple steps.\n\n\n\nCheck it out!\n",
      "categories": ["publications"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/publications/2018-11-27-clarifai-image-classificaiton/"
    },{
      "image": {"path":"/assets/img/projects/subzero.jpg"},
      "title": "NASty Raspberry Pi",
      "date": "2019-03-12 00:00:00 -0400",
      "description": "Article about a collaboration project for a Raspberry Pi NAS.\n",
      "content": "Spent a few weeks working with cybersecurity researcher Josiah Bryant making a device to allow users to quickly and securely share files locally. For example, imagine you were having a get together with friends to talka bout your last big trip. If you all had tons of images/videos which you wanted to share with each other but you didn’t want to publish it to a coporate cloud like Google, you could just utilize our solution to privately share those files amongst each other.\n\nWe published the instructions to create SUBZero back in January 2019. We got a lot of great feedback from the project so we decided to reach out to my favorite Hacker website Hackaday in order to publish a story on it. Check it out and let me know what you think!\n",
      "categories": ["publications"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/publications/2019-03-12-subzero-raspberry-pi-is-nasty/"
    },{
      "image": {"path":"/assets/img/projects/skyminer.jpg"},
      "title": "Playing With Yourself",
      "date": "2019-04-17 00:00:00 -0400",
      "description": "A how-to article on creating your own hardware/software creations!\n",
      "content": "I’ve been making side projects religiously for the past 3 years and it’s been a remarkable experience. I went from making hacked together kindergarten level phone applications that only DJKhaled would like - to making projects that I am incredibly proud of.\n\nIn order to celebrate the hard work I’ve put into my projects as well as give back to the community that has helped me create so many gems - I published a blog post. Inside the blog post you will find valuable resources that have helped me create many of the hardware and software projects around my lab, as well as my story of personal growth over the past few years.\n\nCheck it out and let me know what you think!\n",
      "categories": ["publications"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/publications/2019-04-17-playing-with-yourself/"
    },{
      "image": {"path":"/assets/img/blog/in-plants-jumbo.jpg"},
      "title": "How To Build In-Plants, A Mesh-Connected Soil Monitoring System",
      "date": "2019-05-06 00:00:00 -0400",
      "description": "A how-to article for creating an ecosystem to monitor your house plants.\n",
      "content": "At the beginning of the year I spent some time manufacturing some devices to help keep my houseplants alive, which I named In-Plants. After originally publishing my write up on Hackster.io, my efforts were noticed by the hardware company Particle.io. They happily worked with me to republish my blog post on their website.\n",
      "categories": ["publications"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/publications/2019-05-06-how-to-build-in-plants/"
    },{
      "image": {"path":"/assets/img/blog/startupbus/header.png"},
      "title": "StartupBus 2019",
      "date": "2019-07-24 00:00:00 -0400",
      "description": "5 day trek across the United States allwhile creating a startup.\n",
      "content": "\n  Equal parts boot camp and road trip, StartupBus is an annual competition designed to empower the tech community - challenging top tier talent to hop on a bus and conceive, build and launch a startup in just 5 days.\n\n\n\nSummer of 2019 I competed in StartupBus, and boy howdy was it a journey. To give some background - individuals on the bus (or busentrepeanurs, as we call ourselves) travel across the United States for 5 days. During that time you are working to build a real product that we intend to sell to the public.You have to build an actual MVP, pitch to actual venture capitalists, and build out your company infrastructure all within five days. \n\n\n\n\n\n\n\nI joined a team with two amazing individuals, Anu Jayasinghe and Nate Reicher and together we were working to create a project that we called GreenShip. \n\n\n\n\n\n\n\nThe idea behind GreenShip is super simple. GreenShip empowers you to know the environmental cost of your shipping actions. It’s like looking at a menu with the amount of calories listed next to each item. It’s tempting to go for that juicy burger (the GreenShip team loves the occasional burger!) but maybe the salad is a better call. GreenShip will never tell you not to get that 2 day shipping, but rather let you know the environmental cost so you can make an informed decision.\n\n\n\n\n\n\n\nI mainly worked on the MVP, which ended up being a Chrome Extension. This Chrome Extension pulls your product information at checkout and by leveraging MIT research we are able to tell you the environmental cost of choosing expediated shipping over the other shipping methods. \n\n\n\n\n\n\n\nI could talk about both the environmental implications of expediated shipping or my various decisions on the technology used in this MVP all day but in the end that’s not what I really want to focus on about this experience. The main thing I’m taking from this experience is how amazing it is working with a group of talented individuals. Not just hte specific memebers of my team but also the other busentrepenuers on the journey. We ended up sharing tons of stress, laughs, and ideas together. And even though GreenShip didn’t win the gold in the end - the real gold was the relationships we made along the way.\n\n\n\n\n\n\n\n\n  Demo Video\n  Our MVP\n  Code Repository\n  All photos taken by the talented Odysseas Chloridis\n\n\n\n\n",
      "categories": ["publications"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/publications/2019-07-24-startupbus/"
    },{
      "image": {"path":"/assets/img/blog/Jackp0t.png"},
      "title": "Hacked the DEFC0N27 Badge",
      "date": "2019-08-11 00:00:00 -0400",
      "description": "Hacking the DEFC0N27 Conference Badge\n",
      "content": "\n  DEFCON one of the world’s largest hacker conventions, held annually in Las Vegas, Nevada, with the first DEF CON taking place in June 1993. Many of the attendees at DEF CON include computer security professionals, journalists, lawyers, federal government employees, security researchers, students, and hackers with a general interest in software, computer architecture, hardware modification, and anything else that can be “hacked”.\n\n\n\nEvery year they have a challenge on who can hack the conference badge. This year my team and I (consisting of @Halcyonic, @mlaerten, and myself)\n\n\nThis year’s DEFCON Badge challenge involved social interactions with an RF Badge. A regular attendee is challenged to find and touch badges with 10 different badge types (including Sponsors, Vendors, Goons, and even Press). This becomes super challenging when you have to find one of the 20 individuals out of a 30,000 person conference with a Black “UBER” badge (an exciting but non-trivial task).  It was much easier for us to figure out how to flash the DEFCON27 badge to do three things:\n\n\n\n  Automatically complete the “touch 10 different badge types” challenge\n\n  Easily help our fellow attendees by unlocking their badges with one that can act as a chameleon, emulating all other badge types.\n\n  Profit ???\n\n\nThat’s what the Jackp0t badge does. It automatically puts you in a “COMPLETE” (or win) state on boot and emulates all the different badge types to complete other attendee’s badges in a matter of seconds. \n\n\nCheck out our demo video\n\nHow Did you Become a Village?\n\nQuality Rick Roll\n\n\nCheck out our full writeup here!\n\n\nWe also got some pretty great publicity for being one of the first teams to publish our findings!\n\n    \n      Joe Grand, Creator of the Badge Retweet\n      Reddit Community Embracing\n      Stars on Repository\n      More Shoutouts By Joe Grand\n      Halcy0nic’s Tweet\n    \n  \n\n",
      "categories": ["publications"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/publications/2019-08-11-defc0n-badge-hack/"
    },{
      "image": {"path":"/assets/img/blog/hackster.png"},
      "title": "Blogging for Hackster",
      "date": "2019-08-23 00:00:00 -0400",
      "description": "Started doing some casual tech-blogging!\n",
      "content": "\n  Hackster is the world’s largest network for hardware &amp; software developers. With 1,100,000+ members and 18,000+ projects, beginners and professionals can learn and share how to build robotics, industrial automation systems, AI-powered machines, and everything in between.\n\nFor the past three years I’ve been both publishing and following tons of writers, inventors and creatives on Hackster.io. The website maintains an inspirational community that help promote fun side projects and ingenuis inventions. Which is why I couldn’t be happier that I was approached with an opporunity to start tech-blogging for the community.\n\nAs a technical writer I’ll be responsible for finding cool technical hardware or software projects online, summarizing them so the average user can understand them, and publishing that material for Hackster’s viewership.\n\nCheck out my first piece covering battery-free #IoT environmental tech out of MIT!\n\n\n",
      "categories": ["publications"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/publications/2019-08-23-hackster-blog-writing/"
    },{
      "image": {"path":"/assets/img/blog/solokeys.png"},
      "title": "Finally, an Open-Source Hardware Key",
      "date": "2019-09-05 00:00:00 -0400",
      "description": "My second Hackster.io Blog piece\n",
      "content": "Published my second piece on Hackster this time focusing on some other main interests of mine, cybersecurity and the open-sourced community.\n\nIf you store any aspect of personal data on the internet, then you can understand how important cybersecurity can be. We want to protect our data using high-tech cybersecurity tools but I also believe that is an important for these tools to be public facing, and not hiding any secrets behind closed doors. The Cybersecurity company that I talk about in my second piece SoloKeys, shares this world view and I couldn’t be more excited for the products they are currently developing. \n\nBut I won’t spoil anything for you, feel free to check out my second piece over on the Hackster blog for more details!\n\n",
      "categories": ["publications"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/publications/2019-09-05-open-source-hardware-keys/"
    },{
      "image": {"path":"/assets/img/blog/knobo.png"},
      "title": "A  Braille(-ent) Idea for A Keyboard",
      "date": "2019-09-16 00:00:00 -0400",
      "description": "Accessibility Technology Hacks\n",
      "content": "Published another piece on Hackster!\n\nThis one talks about a Hackaday project, the Knobo, a project that helps individuals type using braile. This is important because braile literacy rates have dropped below 10% in visually imparied children. \n\nCheck out my third piece over on the Hackster blog to learn more!\n\n",
      "categories": ["publications"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/publications/2019-09-16-a-braile-ent-idea/"
    },{
      "image": {"path":"/assets/img/blog/robotfarmdoctors.png"},
      "title": "Autonomous Farming Robot Doctors Are Here to Help Save Agriculture",
      "date": "2019-09-20 00:00:00 -0400",
      "description": "Robots X Agriculture\n",
      "content": "Published another writing piece on Hackster this time focusing on autonomous robots being used to help the agriculture industry.\n\nFarmwise, a San Francisco-based startup, is combining artificial intelligence and robotics to create amazing robots to help farmers \n\nCheck out why farmers are leveraging these technologies in order to adjust to the changes in the environment on my new  Hackster blog piece here!\n\n",
      "categories": ["publications"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/publications/2019-09-20-autonomous-farming-robot-doctors/"
    },{
      "image": {"path":"/assets/img/blog/usbarmorymkii.png"},
      "title": "USB Armory MK II",
      "date": "2019-09-26 00:00:00 -0400",
      "description": "A new cybersecurity tool hits the scene\n",
      "content": "A new super powerful cybersecurity tool is about to hit the market, the USB Armory MK II.\n\nCan’t even begin to talk about all the neat features this USB C powered device has, so make sure to check out my new piece on the Hackster blog for more details!\n",
      "categories": ["publications"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/publications/2019-09-26-usb-armory-mk-II/"
    },{
      "image": {"path":"/assets/img/blog/affordablearm.png"},
      "title": "An Affordable Arduino-Powered Bionic Hand",
      "date": "2019-10-11 00:00:00 -0400",
      "description": "Make an arduino-powered bionic hand for under $100!\n",
      "content": "Modern robotics is full of some amazing things, like Boston Dynamics backflipping robots, but the hardware associated with these robots comes at a fairly steep cost. An industrial robotic arm can cost anywhere from $25,000 to $400,000 and that price tag can stop a hobbyist or tinkerer from experimenting with robotics. Youbionic is intending to change this with its new affordable bionic arm.\n\n…\nContinue reading this piece on the Hackster blog!\n\n",
      "categories": ["publications"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/publications/2019-10-11-affordable-arms/"
    },{
      "image": {"path":"/assets/img/blog/pluspool.png"},
      "title": "+POOL Visualizes Water Quality with Art",
      "date": "2019-10-11 00:00:00 -0400",
      "description": "+POOL Light is an art installation in New York City that informs the public whether river water is safe to swim in.\n",
      "content": "I’ve been living in New York City for two months now and “clean and swimmable” are not the first adjectives that come to my mind when people mention New York City’s urban rivers. This is because New Yorkers are no strangers to the mounds of black trash bags piled on sidewalks outside brownstone residents, local businesses, and high-rise offices. And I can’t help but wonder what percentage of the over 12,000 tons of waste the city produces daily ends up in the nearby waterways. However, a new public art installation, +POOL Light, intends to change the mind of New Yorkers like myself and raise awareness of the current state of our rivers.\n\n…\nContinue reading this piece on the Hackster blog!\n\n",
      "categories": ["publications"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/publications/2019-10-11-pool-visualizes-water/"
    },{
      "image": {"path":"/assets/img/blog/soundshirt.png"},
      "title": "SoundShirt Allows You to Feel the Music",
      "date": "2019-10-22 00:00:00 -0400",
      "description": "The SoundShirt helps the deaf feel the music during live performances or within video games.\n",
      "content": "Watching live music is such a unique auditory experience. You get to see a talented band or an artist on stage express their personality while getting to hear both instrumental sounds and vocals blend around you in real-time. But, for the deaf community, that auditory experience can be unavailable, which can attribute to feelings of social isolation. A fashion tech company, Cute Circuit, intends to promote more inclusion during performances by allowing the deaf to begin feeling the music with SoundShirt.\n\n…\nContinue reading this piece on the Hackster blog!\n\n",
      "categories": ["publications"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/publications/2019-10-22-soundshirt-feel-music/"
    },{
      "image": {"path":"/assets/img/blog/nfccopycat.png"},
      "title": "NFC Copy Cat — One Stop Shop for Testing Payment Systems",
      "date": "2019-11-06 00:00:00 -0500",
      "description": "NFC Copy Cat is a device to learn and test both magnetic stripe and NFC payment systems. It does so utilizing the tools NFCopy and MagSpoof.\n",
      "content": "Many of the coffee shops I go to in New York City no longer have magnetic swipe card readers, in favor of more secure near-field communication (NFC) readers —  the method of wireless data transfer that’s used for services like Apple Pay. But as payment systems evolve, so do cybersecurity researchers who learn of new ways to reveal the flaws in current technologies. One such researcher, Salvador Mendoza, is exposing vulnerabilities with payment systems using his device NFC Copy Cat. \n\n…\nContinue reading this piece on the Hackster blog!\n\n",
      "categories": ["publications"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/publications/2019-11-06-nfc-copy-cat/"
    },{
      "image": {"path":"/assets/img/blog/ambienBeat.png"},
      "title": "Subliminally Hack Your Heart with ambienBeat",
      "date": "2020-01-23 00:00:00 -0500",
      "description": "A wrist-worn heart rate regulator to help manage stress and stay awake.\n",
      "content": "Life can be a balancing act when it comes to managing stress. There are a lot of external stimuli that we utilize to reset our bodies like drinking a cup of coffee to stay awake late at night or some herbal tea to get to bed. MIT’s Tangible Media Group wants to take a new approach to our external health by using our own internal heartbeat to subliminally hack our well-being with ambienBeat. \n\n…\nContinue reading this piece on the Hackster blog!\n\n",
      "categories": ["publications"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/publications/2020-01-23-ambienBeat/"
    },{
      "image": {"path":"/assets/img/blog/trezorglitch.png"},
      "title": "Kraken Security Labs Can Now Voltage Glitch Trezor Wallet Cryptocurrency Away",
      "date": "2020-02-12 00:00:00 -0500",
      "description": "Using voltage glitching, Kraken Security Labs has found a way to crack the encrypted seeds in Trezor cryptocurrency hardware wallets.\n",
      "content": "Many individuals who own cryptocurrency have begun to use hardware wallets to enable two-factor authentication for their digital cryptocurrency. However, it’s hard for any piece of technology to truly be secure as one of the largest hardware wallet providers, Trezor, is learning. Kraken Security Labs, a security affiliate of the cryptocurrency exchange Kraken, has recently found a way to crack Trezor Wallets encrypted seeds using voltage glitching.. \n\n…\nContinue reading this piece on the Hackster blog!\n\n",
      "categories": ["publications"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/publications/2020-02-12-trezor-glitch/"
    },{
      "image": {"path":"/assets/img/blog/airgen.png"},
      "title": "New Green Technology Generates Electricity \"Out of Thin Air\"",
      "date": "2020-02-19 00:00:00 -0500",
      "description": "Researchers at the University of Massachusetts Amherst have developed a device called Air-gen that generates electricity using water vapor.\n",
      "content": "Solar power needs concentrated sunlight, wind power requires strong winds, and hydroelectric power requires strong currents, but now there’s a new green technology that only needs the air around it. Researchers from the University of Massachusetts Amherst have recently developed a device to create electricity, only using moisture in the air by leveraging naturally occurring proteins. \n\n…\nContinue reading this piece on the Hackster blog!\n\n",
      "categories": ["publications"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/publications/2020-02-19-air-gen/"
    },{
      "image": {"path":"/assets/img/blog/urukey.png"},
      "title": "Safely Navigate the Web with URU Key, a FIDO2 Authenticator",
      "date": "2020-02-19 00:00:00 -0500",
      "description": "URU Key is a small, custom FIDO2 Authenticator that uses a fingerprint scanner to authenticate yourself on WebAuthN-enabled websites.\n",
      "content": "The internet was not designed with security in mind, but new standards are helping to ensure that users can continue to safely and easily interact with it. A standard called FIDO2 WebAuthN allows users to login to their accounts online using their biometrics, mobile devices, or FIDO security keys — and with much higher security over passwords alone. Andrey Ovcharov, a hobbyist electrical engineer, is working on implementing a custom FIDO2 Authenticator with his hardware project URU Key. \n\n…\nContinue reading this piece on the Hackster blog!\n\n",
      "categories": ["publications"],
      "tags": [],
      
      "collection": "posts",
      "url": "/blog/publications/2020-02-19-urukey/"
    },{
      
      "title": "Certifications",
      "date": "2023-11-08 16:16:38 -0500",
      "description": "Different certifications or awards that are given to me.\n",
      "content": "\n",
      "categories": [],
      "tags": [],
      
      "collection": "featured_categories",
      "url": "/blog/certifications/"
    },{
      
      "title": "Public Speaking",
      "date": "2023-11-08 16:16:38 -0500",
      "description": "Different public speaking events.\n",
      "content": "\n",
      "categories": [],
      "tags": [],
      
      "collection": "featured_categories",
      "url": "/blog/public-speaking/"
    },{
      
      "title": "Publications",
      "date": "2023-11-08 16:16:38 -0500",
      "description": "Publications that I either published or I was interviewed for.\n",
      "content": "\n",
      "categories": [],
      "tags": [],
      
      "collection": "featured_categories",
      "url": "/blog/publications/"
    },{
      "image": {"path":"/assets/img/projects/4_hmcole.png"},
      "title": "H.M.Cole",
      "date": "2018-03-10 00:00:00 -0500",
      "description": "H.M. Cole is an American company specializing in crafting custom clothing for all aspects of life: professional attire, casual wear, formal dress, and even outerwear. H.M. Cole has showrooms in America, where managers, consultants, and tailors will help you choose the style, fabric, and design of a suit and then take your measurements.\nPurpose and Need\nH.M. Cole was in need of update their website to make clothing, and add more features. Our task was:\n    - Generally, update the overall look and feel of the application to be more stylish and sleeker\n    - Extend the measurements UI to allow tailors to enter measurements in all possible modes (fully custom, based on standard size, based on past orders) for all available types of products\n    - Update the product customization wizard to contain more options, becoming minimalistic and simple for customers, while powerful for tailors\n    - Extend the payment system\n    - Implement a limited landing page editor\n\nWorkflow\nWe didn’t create a clothing website from scratch, but redesigned the site entirely: upgraded the front end to Angular 2+, implemented UI for tailors to enter customers’ measurements, and established data synchronization with the Odoo instance, used by the factory.\n\nTechnology\nUnder H.M. Cole’s hood, there are Django, Python, Angular 5, NGRX, Typescript, and PostgreSQL.\n\nStructure and Features\nTo match H.M. Cole’s concept, our partners offered a modern, original, and stylish design. The task was quite challenging:\n\n\n  \n    The site is used by tailors and customers. We needed the UI to be mostly the same, while the tailors needed more features.\n  \n  \n    The main use case is the following: the tailor and customer discuss order details, and the tailor enters the order alongside measurements to the system, while the customer is sitting next to him. So the UI must have a bunch of functionalities available for a power user while still being minimalistic and stylish so customers love it.\n  \n  \n\n\nTailor’S Use Case\nThere are two types of users: customers and tailors. The tailor’s use case is the most common. Here is how it works:\n\n\n  \n    When a customer enters the shop, the tailor either creates a customer record in the system or selects an existing customer to shop for.\n\n  \n  \n    Together with the client, the tailor adds products to the cart and customizes each of them. Here is an example of jacket customization. H.M. Cole is all about fully custom clothing tailored to match any customer’s preference, so there are tons of available options. On this screenshot, we see only the options available to the customer. The tailor’s UI allows for even more detailed customization.\n\n  \n  \n    After filling in all the necessary fields, the tailor goes to the measurements section. There are three modes of measurements UI:\n\n    \n      \n        Fully custom measurements – the tailor takes the measurements required for selected products. In order to adjust the suit’s fit (slim, comfort, etc.), the tailor can adjust allowances.\n      \n      \n        Measurements based on standard size – the tailor selects one of the predefined product sizes and applies adjustments.\n      \n      \n        Measurements based on past orders – the tailor makes adjustments to past orders so the user can add the shirt “the same as last time, but with a little shorter sleeve.”\n\n      \n      \n        There are also some built-in rules, like which measurements are needed for which product, which measurements can have allowances, and others.\n      \n    \n\n    \n  \n  \n    When an order is ready and all the measurements are entered, payment is made, and the order is sent to the factory using the Odoo API. Order data is updated in Odoo as the order is moving through the production pipeline. Changes are synchronized back to the Django back end.\n\n  \n\n\nLanding Page\n\n\nResults\n\n  We redesigned an application.\n  We improved the customization wizard to make it easy to use.\n  During half a year of the project, we expanded the interface of measurements.\n  We moved from Angular 1.x to Angular 5.\n\n",
      "content": "\n",
      "categories": [],
      "tags": [],
      
      "collection": "projects",
      "url": "/projects/4_hmcole/"
    },{
      "image": {"path":"/assets/img/projects/10_priceshape.webp"},
      "title": "PriceShape",
      "date": "2018-06-10 00:00:00 -0400",
      "description": "We’ve developed this price comparison web system from scratch. By monitoring price information of 4.5 million products daily, it helps online retailers overcome fierce competition. To enable constant processing of such a huge amount of data, our team used modern technologies and designed a holistic architecture.\nOverview\nPriceShape is a price comparison platform for e-commerce stores. By scraping data from competitors’ websites, it allows online retailers to monitor prices for the specific products offered on the market as well as develop and implement a winning pricing strategy.\n\n\n\nCore features for store owners\nWith PriceShape, online store owners can monitor all price fluctuations in their target markets and win over digital buyers by creating the most favorable offers for selected products. Here’s what online retailers can do using the platform:\n\nCreate a customized dashboard\n\n  \n    The PriceShape platform allows its users to create dashboards customized precisely to their needs. This means store owners can easily pick the most important insights to visualize and get quick access to. For example, they may choose to view their company’s statistics, product price positions, stock status, turnover, etc.\n  \n  \n    PriceShape dashboards are built in a user-friendly format, which allows stock owners to easily grasp key information and make quick but informed decisions.\n  \n\n\n\n\nMonitor competitors\n\n  \n    With PriceShape, retailers can search for competitors using their websites or shopping aggregators and closely monitor selected stores.\n  \n  \n    The platform provides access to a vast amount of competitor data, including pricing history, stock status, real-time pricing information, and much more. All the data is collected automatically, so users don’t need to waste time visiting other e-commerce stores and checking changes manually. Additionally, the user can get notified when a competitor increases or reduces a price for a certain product.\n  \n\n\n\n\nChoose the right pricing strategy\n\n  \n    PriceShape allows users to create an optimal pricing strategy for their online stores. For example, a store owner may want to always have the lowest prices on specific products or increase prices when other competitors are out of stock for certain items.\n  \n  \n    When using PriceShape, retailers get recommendations on how they can tweak their prices for products to adjust them to the current competitive landscape. Due to the integration with an online store, the changes are immediately reflected on the user’s website.\n  \n\n\n\n\nImplement dynamic pricing\n\n  \n    PriceShape allows users to automatically control their own prices, using customized strategies. All retailers need to do is select competitors for certain products and define their pricing rules (e.g., increase or decrease a price depending on competitors’ pricing information). The platform reprices the products once these conditions arise — no human intervention is required.\n  \n  \n    With automatic pricing adjustments, online retailers can always stay a step ahead of the herd.\n  \n\n\n\n\nOptimize Google Shopping feed\n\n  \n    PriceShape helps retailers optimize their Google Shopping setup for a better return on advertising spend (ROAS), higher click-through rate (CTR), and more sales.\n  \n  \n    After a retailer uploads a file with its products to PriceShape, the platform automatically searches for competitors and adds custom PriceShape labels to the feed. As a result, store owners can adjust their bidding and spend their marketing budget in the most effective way.\n  \n\n\n\n\nGet domain summaries\n\n  \n    With the PriceShape platform, store owners get comprehensive overviews of their competitors’ domains. This includes the number of products that overlap and a list of products that a user lacks but that its competitors offer.\n  \n  \n    On top of that, the domain summary shows their competitors’ current pricing strategy, along with their pricing history. It also provides information on the competitors’ inventory statuses. All insights are presented on intuitively designed dashboards, so users can easily grasp and analyze them.\n  \n\n\n\n\nCore features for brands\nAfter the first release of the PriceShape platform, the client asked us to update it with the functionality for brands that want to get a better overview of their resellers. Here are the features the platform offers for this category of users:\n\n\n  Monitor prices and stock statuses\n    \n      \n        PriceShape allows brands to monitor how products are sold by each reseller. All the user has to do is upload their product feed to the platform. Once that’s done, PriceShape will show the resellers’ prices and stock statuses.\n      \n      \n        PriceShape also provides access to resellers’ pricing history, so brands can easily check out the cost of a certain product in resellers’ stores on a particular day, for example, on Black Friday.\n      \n    \n\n    \n  \n  Receive notifications and reports\n    \n      \n        With PriceShape, brands can keep track of all the changes resellers make. For example, when prices for some products increase or decrease, they can get email notifications.\n      \n      \n        On top of that, brands can receive automatically generated reports. They can personalize these reports, send them to other team members, or access them anytime from the dashboard.\n      \n    \n\n    \n  \n  Customize the dashboard\n    \n      \n        The platform lets users customize their dashboards to gather all important insights in one place and get quick access to them.\n      \n      \n        Users can also personalize their dashboards by adding one or several widgets to them. This makes the most critical information easily and immediately visible. For example, users may choose a widget that shows top resellers, labels, or tags.\n      \n    \n\n    \n  \n  Find potential resellers\n    \n      \n        Besides monitoring current resellers, PriceShape helps brands find new ones all over the globe.\n      \n      \n        The platform provides information on all stores that sell similar products in the selected country. Brands can use these insights to enter foreign markets faster without wasting time finding potential resellers manually.\n      \n    \n\n    \n  \n\n\n",
      "content": "\n",
      "categories": [],
      "tags": [],
      
      "collection": "projects",
      "url": "/projects/10_priceshape/"
    },{
      "image": {"path":"/assets/img/projects/6_leostep.png"},
      "title": "LeoStep",
      "date": "2019-11-10 00:00:00 -0500",
      "description": "Interactive walking, running, and cycling mobile app with gamification elements to enhance employee wellness\nAbout The Project\nLeoStep is a dynamic walking, running, and cycling app designed by Leobit for the internal employee wellness program. Its primary goal is to motivate users to engage in regular physical activity, specifically walking, by incorporating gamification elements. The app transforms daily walks into an enjoyable and interactive experience, encouraging users to adopt a healthier and more active lifestyle.\n\n\n\nProject in Detail\nThe app’s development proceeded through structured phases. Initially, I conducted an examination of user behavior, and subsequently, I integrated more advanced features based on our observations. Leostep integrates gamification components as ‘crystals’ that turn regular walks into an engaging and interactive journey across the city.\n\n\n\n\n  \n    Streamlined Registration Process\n    - The app simplifies registration for user convenience by offering quick signup options instead of lengthy forms. We’ve prioritized user convenience by incorporating a range of registration methods: leveraging social media accounts, utilizing email addresses, and, specifically for iOS users, harnessing the power of their Apple ID.\n  \n  Referral System\n  Push Notifications\n  Integration with iOS health App\n  Connection Community\n\n\nResults:\n\n  Employees encouraged to engage in daily physical activities.\n  600+ hours of workouts in 4 months\n  3,500 kilometers traveled\n\n\nDynamic Daily Goal System\n\n  \n    Our development team identified that repetitive tasks decrease user motivation towards app usage. Subsequently, we introduced a system of daily goals that adapts based on each user’s proficiency level. It keeps users engaged, as they can observe their progress and witness the challenges increasing as they advance through higher levels.\n  \n  \n    We implemented a personalized level badge system that rewards users for achieving specific milestones, such as reaching a certain number of steps or collecting a set of crystals. Special algorithms track user progress and dynamically adjust the goals based on the user’s level and achievements.\n  \n\n\n\n\nGamification Elements\n\n  \n    To enhance user engagement during walking activities, the app employs an interactive feature called “crystals”, placed on the map for users to collect as they approach them. There are 4 types of crystals, each has its own unique value and offers users additional points. Once users gather a specific set of crystals, they receive additional points, incentivizing them to explore different locations to maximize their rewards. Users have the opportunity to earn even more points by collecting a “star”, which requires the collection of specific crystals in a certain sequence.\n  \n  \n    Technical implementation includes interaction with Google Maps API, utilizing their analytics to track and send crystal coordinates from the backend to the user’s device. The selection of the locations is meticulously determined using data from Google Maps, which aids in identifying suitable public areas for crystal placement. This integration enables accurate tracking of crystal locations and real-time updates on the map. The app utilizes the device’s location capabilities to determine the user’s current position. Upon meeting all required permissions, the app checks if the user is within a proximity of 3–4 meters from a crystal. If this condition is met, the crystal is considered acquired.\n  \n\n\n\n\nAdvanced Workout Recording\n\n  \n    The app leverages advanced workout recording functionality to track and document physical activities. As users engage in walking or cycling, the app records their movement, capturing valuable metrics such as distance covered, duration, and other relevant data. To provide a visual representation of the employees workouts, the app integrates with Google Maps. The integration allows the app to utilize Google Maps’ analytics and mapping capabilities.\n  \n  \n    As a result, users’ paths are precisely drawn on the map, providing a clear and accurate depiction of their workout routes. These recorded workouts are securely saved within the app, granting users convenient access to review their progress over time.\n  \n\n\n\n\nTeam Competitions\n\n  \n    In LeoStep, users have the option to create their own teams or join existing ones, enabling them to embark on virtual adventures with chosen colleagues. Each team has levels and goals, which dynamically increase based on the team’s progress. Furthermore, team levels serve as a rewarding system, where higher levels unlock the ability to recruit more team members. This fosters healthy competition and motivates teams to work together to achieve higher milestones.\n  \n  \n    We integrated Leaderboard into the app, fostering a sense of healthy competition and motivating users to strive for top positions by engaging in more walking, running or cycling activities. The implementation of the Leaderboard involved designing a robust scoring system that tracked user activities, crystal captures, and goal completions in real-time, ensuring users had immediate visibility of their ranking and progress compared to others.\n  \n\n\n\n",
      "content": "\n",
      "categories": [],
      "tags": [],
      
      "collection": "projects",
      "url": "/projects/6_leostep/"
    },{
      "image": {"path":"/assets/img/projects/14_realestate.webp"},
      "title": "Real Estate",
      "date": "2021-06-10 00:00:00 -0400",
      "description": "In 2021, with over 60 years of history to its brand, the customer’s company ranked among the best US full-service real estate agencies, closing over 20 million in sales that year. Our customer became one of the first industry leaders to understand the potential value of blockchain and its potential impact on the future of real estate. Constantly implementing new initiatives to stay on top in the competitive market, the company partnered with Leobit to develop an easy-to-use blockchain-based system and web portal for buying and selling real estate items.\nProject Overview\n\n  \n    Leobit’s client realized that reliability, data accuracy and security are imperative in the real estate business. That’s why they wanted to boost their proprietary solution with blockchain technology. A blockchain-based real estate portal would provide trusted proof of evidence of the origin of their listed property. First, blockchain decentralization allows all participants to have a “single source of truth” and be sure of information transparency. Second, a blockchain-powered platform makes it virtually impossible for someone to change the data. Thus, the publicly available payment history and background associated with a specific property item are valid and equitable.\n  \n  \n    The real estate industry involves a lot of players like banking institutions, insurance companies, brokers, lawyers, agents, etc. It’s crucial to maintain correctness and completeness of real estate property records as they can be used in resolving disputes, protecting owners’ rights, ensuring updated ownership transfers, preventing fraudulent activities. Implementing decentralized data storage based on blockchain technology, the biggest challenge I faced was data aggregation from all these sources, additionally to automatically collecting property data from other public sources. However, I gave all these participants a clear mechanism of integrating with the blockchain directly or by using a convenient and developer-friendly API to access blockchain data in a simple and meaningful way.\n  \n\n\nProject Description\n\n  \n    Land ownership and land titles registration continue to rely on paper documentation. Property transfers require costly and time-consuming procedures that could easily be exposed to fraud and mismanagement. Leobit helped the customer to digitize their business with a fully-functioning blockchain-powered platform. The solution, powered by Microsoft Azure, uses blockchain technology to describe real estate assets, collect all the required associated information from public sources, make essential documents validated and easily accessible to necessary parties. I replaced the property listing SQL database with blockchain-based storage. Here, blockchain makes the system more transparent, keeping all records of previous transactions in one place and prohibiting any changes to historical records.\n  \n  \n    Having no limitations on the technology stack from the customer, Backend team used .NET Core for the back-end infrastructure and Angular for the front-end development. This stack combination enabled quick development, guaranteed product security and scalability, and decreased development costs for the customer.\n  \n\n\nTechnology\n\n  \n    Customer Location\nTexas, USA\n  \n  \n    Technologies\nASP.NET, .NET 5, Angular, SQL, Bootstrap, Blockchain, Microsoft Azure\n  \n  \n    Team\n5-6 team members at different project stages\n  \n\n\nFeatures &amp; Functionalities\n\n  Opportunity to manage multiple listings of properties offered for selling and buying\n  Enhanced property search experience with personalized content for well-considered decisions\n  Access to the full descriptive listing details with high-quality photos of each property\n  Ability to get an impression of a neighborhood, routes and location of the property thanks to Google Maps integration\n  Single unified blockchain-based environment with full transaction history and legit data on each property\n\n\nEnd Users\n\n  Private and corporate real estate industry players (banking institutions, insurance companies, brokers, lawyers, agents, etc.); other real estate service providers using our solution as PaaS.\n\n\nResults\n\n  \n    Paying tribute to the traditional real estate ecosystem, the Leobit’s customer was still ready to step aside from it and leverage the latest information technology to drive business growth. With a blockchain-based solution developed by Leobit experts, they attracted new clients increasing sales revenue by 20% within the first year after the product launch. The blockchain-based real estate platform easily replaced the roles of brokers, lawyers, and banks. It guarantees transparency and immutability of information, thus making unnecessary intermediaries and saving end-clients money on commissions and fees. Decentralized storage managed by various participants also enhanced clients’ trust in the system. Since multiple users can verify the information, buyers and sellers are more confident in secure and successful transaction outcomes.\n  \n  \n    With a blockchain-based MLS database, I provided all parties with a single version of verified aggregated information, a secure environment for data sharing, transaction and real-time payment monitoring. The property registry is automatically updated and maintained in one place, ensuring accuracy, transparency and security of the information, so all real estate deals are based on accurate and valid data.\n  \n  \n    Leobit’s development team ensured that the solution could function in two modes depending on the customer’s clients’ needs and preferences:\n\n    \n      SaaS – available for end-users to access and operate it via web-browser\n      PaaS – helps other real estate service providers to create their applications based on our platform\n    \n  \n  \n    This business approach to the developed product expanded the client base of our customers from private to corporate ones.\n  \n\n",
      "content": "\n",
      "categories": [],
      "tags": [],
      
      "collection": "projects",
      "url": "/projects/14_realestate/"
    },{
      "image": {"path":"/assets/img/projects/11_quan2um.png"},
      "title": "Quan2um",
      "date": "2022-05-10 00:00:00 -0400",
      "description": "Quan2um is a trusted cryptocurrency exchange where users can buy and sell popular listing coins. It has a high level of security that meets European standards. The platform has a bonus system for new customers with a multi-level commission system. On the exchange, you can invest in your own Quan2um coin - BTCA, and receive passive income.\nTechnology\n\n  Tech Stack\nCSS, HTML, Laravel, MySQL, PHP, React JS, Redis, Node JS\n  Number of Sprints\n32\n\n\nOverview\nQuan2um is a trusted cryptocurrency exchange where users can buy and sell popular listing coins. It has a high level of security that meets European standards. The platform has a bonus system for new customers with a multi-level commission system. On the exchange, you can invest in your own Quan2um coin - BTCA, and receive passive income.\n\n\n\nTasks and Challenges\n\n  \n    We were faced with the task of implementing a trading platform that allows traders to track the current situation on the market in real time. At the same time, the ready-made solution was supposed to control and keep the price of the pair within the average market.\n  \n  \n    It was important to ensure the necessary liquidity of the market and the fastest possible purchase / sale of currency. Also, one of the key aspects was the safety and security of user funds.\n  \n  \n    The platform created its own cryptocurrency - BTCA, which needed promotion, with which it needed help.\n  \n  \n    It was necessary to implement a resource management system with flexible settings. The functionality was supposed to allow managing roles, providing simple management of coins and trading pairs.\n    - Develop Real-time marketplace\n    - Implement control of the average market price of pairs\n    - Ensure market liquidity\n    - Take care of the safety of users’ cryptocurrency storage\n    - Develop a BTCA promotion strategy\n    - Implement site administration (admin panel)\n    - Implement matching for trading between users\n    - Write an investment system\n    - Create a referral program\n    - Add User Level System\n  \n  \n\n\nWhat was done\n\n  \n    For a cryptocurrency exchange, the relevance of information is extremely important. For this reason, we focused on this and first raised and configured our socket server. This allowed us to receive new prices and new offers on the market as quickly as possible.\n  \n  \n    To keep the price of the pair close to the market average, we started from the prices received from Binance, Kraken, and Kucoin\n  \n  \n    To ensure the liquidity of the market, we have created a liquid and trading bot. So we managed to manage and maintain an acceptable number of offers on the market.\n  \n  \n    All created pairs of keys for crypto-wallets, which we stored on the server of cold wallets in encrypted form. All withdrawal operations were carried out exclusively through the hot wallet server. This made it possible to provide a high level of security.\n  \n  \n    One of the main tasks of the service was to popularize the personal cryptocurrency BTC. To do this, we have implemented a module for investing in BTC master nodes, with the possibility of receiving passive income.\n  \n  \n    To index the site, a framework was used that allows rendering pages on the server-side.\n  \n  \n\n\nResults\n\n  Ready resource management system\n  Matching system\n  Implemented the ability to invest in the BTCA master node\n  A multi-level commission on the service has been developed\n  It is possible to bring users through a referral program\n\n",
      "content": "\n",
      "categories": [],
      "tags": [],
      
      "collection": "projects",
      "url": "/projects/11_quan2um/"
    },{
      "image": {"path":"/assets/img/projects/8_neptyne.webp"},
      "title": "Neptyne",
      "date": "2022-05-12 00:00:00 -0400",
      "description": "We all love building stuff in spreadsheets. But despite the near-infinite possibilities they offer, we all know you can’t build a whole application on top of a spreadsheet. At some point, making formulas more complicated or adding unstable VBA macros just doesn’t scale. Neptyne does away with this limitation. By leveraging the power of the Python ecosystem and artificial intelligence, it turns the spreadsheet into a true app development platform.\nOverview\n\n  \n    Neptyne is a startup product that provides users with cloud-based programmable spreadsheets. While supporting the standard actions and shortcuts that users expect from spreadsheet software, it also allows you to write and run Python code.\\\n  \n  \n    You can use all the power of Python coding by installing libraries, integrating third-party services and scheduling periodic tasks. Neptyne also provides interactivity through input widgets such as buttons, dropdowns, and checkboxes. By using them in combination with Python code, you can not only manage sheets, but also easily develop accessible applications for your needs.\n  \n\n\n\n\nPurpose and Need\n\n  \n    I believe, Neptyne has a great potential in empowering spreadsheets with a programming language and AI-powered coding assistant. Regular spreadsheet users can do their work as usual and reduce their efforts by using artificial intelligence to import data or create visualizations.\n  \n  \n    The ability to write code in Neptyne allows you to automate your workflow even more, turning an ordinary spreadsheet into real-time stock market analytics, sports predictions, or even a tic-tac-toe game board! AI is also good at generating such code.\n  \n  \n    Neptyne is well suited for any business that relies on spreadsheets but feels the need to automate work and reduce effort. This also works for scientific work, as researchers tend to use Excel and Python/R a lot and are not always happy because they are different tools.\n  \n\n\n\n\nWorkflow\n\n  \n    I worked as a full time contractor on a product, but Neptyne is a different case. In the course of this project, I have been integrated into a team managed by the owner. Task management was done on the side of the business owner, and I helped formalize the tasks.\n  \n  \n    The business owner had a clear idea of what problems he wanted to solve with a particular feature, but the actual implementation of the features was a collaborative process. I’m confident that this not only helped deliver high-quality features on time and on budget, but also resulted in functionality that meets the highest industry UX standards.\n  \n\n\nTechnology\n\n  \n    Neptyne uses Python and heavily modified Jupyter Notebook on server-size and React.js on the client-side. Client-server communication is carried out in real time and implemented using websockets.\n  \n  \n    Another feature is virtualized user environments: users are able to utilize fully functional Python environments with third-party Python libraries, even with C++ dependencies. And while they can do whatever they want, they can’t “break” the main Python container that runs the app itself.\n  \n  \n    One of our challenges was to improve client-side performance and make sure it doesn’t get negated by successive regressions. To achieve this, we designed a tiny in-house library to measure a number of re-renders of React components. If new props we add are unstable, the tests will fail and the developer will have to deal with it before it affects the end user.\n  \n\n\nStructure and Features\n\n  \n    Simple Migration Flow\nA sheet editor interface with familiar features and shortcuts. User can switch from any sheet editor they currently use.\n  \n  \n    Python Support\nThe sheet content can be generated using Python expressions, including API calls and data preprocessing. \n\n  \n\n\nInput Widgets\nButtons, scrollers and checkboxes that can run any Python code on interaction.\n\nOutput Widgets\nCharts, images and maps filled with user data.\n  \n\nAI Assistant\nAI assistant for generating Python code, widgets or filling sheets with new data generated/fetched by the AI. All of this can be done using natural language, without any Python knowledge.\n\nTemplates\nA vast selection of “plug and play” templates for different business needs and requirements - accounting, trading or sports events prediction.\n  \n\nReal-time Collaborative Editing\nAll the changes are applied in real-time.\n\nEmbedded Code Editor\nUsing this in-app code editor, the user is able to write Python code making use of syntax highlighting, context-aware autocomplete and autoformatting. The user is able to write both persistent code in a file and one-time commands using REPL.\n  \n\nResults\nDuring our cooperation, I comprehensively refactored the client side, boosting its performance and fault tolerance. I also did a comprehensive product redesign, adding tools to introduce further changes (e.g. dark mode) more easily. While being presented on PyCon, Neptune is still a start-up in its pre-seed funding stage. However, it is fully accessible for free, with a soon-to-be-announced Pro tier with more features and resources. It is a flexible tool that could be used in many domains and we hope it will have a bright future!\n\n\n",
      "content": "\n",
      "categories": [],
      "tags": [],
      
      "collection": "projects",
      "url": "/projects/8_neptyne/"
    },{
      "image": {"path":"/assets/img/projects/03_mason.png"},
      "title": "Mason",
      "date": "2022-06-10 00:00:00 -0400",
      "description": "“At ModeMagic, we power Shopify storefronts with nocode store blocks on auto-pilot. Power up with one-click 📈sale+stock automations, convert better with 🛍️product guides &amp; how-to’s, and deliver real-time price &amp; 🛒bestseller updates with badges.”\nOverview\n\n  \n    Create smart collections &amp; categories in less than 60 secs\n  Special discount for a limited time only? Beauty products under $20? Build smart automated collection pages and showcase them across your storefront with advanced inventory rules and personalisation strategies —beyond what’s available on Shopify.\n  \n  \n    Launch AI-powered recommendations without any guesswork\n  Take the guesswork out of finding the right product mix and move fast with AI-powered product bundles and recommendations. Cross-sell and upsell your products with pre-configured templates or customise them as you want, edit and publish it from store to checkout in minutes.\n  \n\n\nPURPOSE AND NEED\nThe goal was to create more leads by showing buyers the most relevant deals and offers, collections and product recommendations based on their journey with no code setup. There are five parts in this app - sales &amp; promos on autopilot, showcase tailored merchandise, predict algorithm of shopper’s intent, browse-to-buy plugin and store performance analysis. My role was as a full-stack engineer and I was responsible for developing the mentioned features using technology stacks - React, Django, AWS S3, Lambda, Katra, Firebase and MySQL.\n3 Key features of Mason\nBoost conversions, lift margins, and drop browse abandonment — all from one place.\nConvert more\n\n  \n    Personalized Offers\n  Understand shoppers and deliver personalized incentives when they need them most.\n  \n  \n    Smart Cross-sells &amp; Upsells\n  Surface AI-powered product bundles and volume discounts tailored to each visitor’s preferences.\n  \n  \n    VIP Sales &amp; Lightning Deals\n  Schedule multiple flash deals optimally timed for maximum sales impact.\n  \n\n\n\nEngage better\n\n  \n    Shoppable AI quizzes\n  Use AI powered games to engage users at the right time and capture zero party data\n  \n  \n    Spin the Wheel\n  Increase zero-party data capture rates using mini-games like Spin and Earn.\n  \n  \n    Welcome Incentives\n  Entice new users and foster their repeat visits with attractive incentives.\n  \n\n\n\nAutomate fast\n\n  \n    Catalog Changes\n  Be it new launches, bestsellers, or any catalog changes - ensure catalog feeds stay updated across all channels.\n  \n  \n    Inventory Sync\n  Automate stock updates across the store - no manual oversight needed.\n  \n  \n    Price Updates\n  Ensure customers always get to see the right price instaneously on any channel they shopping from.\n  \n\n\n\n",
      "content": "\n",
      "categories": [],
      "tags": [],
      
      "collection": "projects",
      "url": "/projects/03_mason/"
    },{
      "image": {"path":"/assets/img/projects/13_wellcaster.png"},
      "title": "WellCaster",
      "date": "2022-12-10 00:00:00 -0500",
      "description": "We partner with companies in the learning arena to help them thoughtfully and efficiently transform their knowledge into something that can be delivered via mobile to their employees or customers.\nOverview\nWellCaster is a platform that helps coaches sell their training programs and helps their clients stick to a goal and complete programs. We implemented the first version of the application, then it was supported by other developers.\n\n\n\nPurpose and Need\nFitness software was conceived as a new way of connecting users with experts to achieve fitness and healthy-living goals. Among other fitness and health products, WellCaster educates, instructs, and motivates, all within a framework designed to make a lasting impact.\n\nWorkflow\nI developed an MVP of the project. While looking for the correct product vision to fit the market, I’ve developed different features that didn’t make it to the final product but were still a lot of fun to do. For example, there were three versions of the WellCaster builder, registration wizard, and manual video encoding on our server before we moved to Amazon.\n\nTechnology\nOn the technical side are Angular, Django, Python, and Sass. Almost the entire interface is built with Angular using the REST API.\n\nStructure and Features\nEditor\n\n  WellCaster has different UIs based on user type: coaches and clients. The most interesting part of the project is the coach part (personal trainer client management software), where a user can compose a training program using our flexible editor.\n    \n  Training program consists of days; for each day, the coach can set one or multiple goals to achieve. Goals can be very different, from having a healthy breakfast to running a marathon. The editor is based on Angular and uses an extensible back-end API we built to support different types of goals.\n  \n  A coach can add new ad-hoc goals or reuse existing ones from the library. This is useful for gym or yoga exercises; the coach only describes the technique once and then just specifies reps and sets for each specific training session. Data is validated on the client’s side and on the back end, so it’s always correctly formatted.\n\n\n\n\nMedia Library\nAn interesting feature built for this site is a media library. Whenever a user needs to upload a file, he is presented with this nice sliding panel containing his entire media library. The user can either upload new files or reuse existing ones. All media is directly uploaded to s3, so there are no traffic hits on the application server. Video files are converted to multiple formats using an Amazon video transcoder.\n\n\n\nCalendar\n\n  \n    We also built this cool scheduling section, where coaches can manage both group and individual classes.\n  \n  \n    Using the calendar on the coach page, clients can book training time and pay for it using our custom UI, built on top of Stripe.\n  \n\n\n\n\nMobile App\nThe mobile application was built by the client’s developers using this API. Since the entire application is built with Angular, we already had the REST API, and we only needed to adjust it a little to work more effectively with the mobile application structure.\n\n\n\nOne of the features built purely for the mobile app is streaks, or habits. A habit is a simple task you repeat every day. For example, a user can start a habit of running. Every day, he or she goes for a run and then marks the task complete. We track progress, build charts, and let users compete with each other.\n\n\n\nPublic pages are served as simple HTML, without Angular, so that they are correctly indexed by search engines.\n\n\n\nResults\nI successfully built and launched the MVP of fitness management software, which was subsequently finalized and improved by another group of developers.\n",
      "content": "\n",
      "categories": [],
      "tags": [],
      
      "collection": "projects",
      "url": "/projects/13_wellcaster/"
    },{
      "image": {"path":"/assets/img/projects/2_supreme.png"},
      "title": "Supreme AI",
      "date": "2022-12-10 00:00:00 -0500",
      "description": "Make copywriting easier and more efficient than ever before with Supreme AI Writer. This groundbreaking product offers a powerful yet simple way to create compelling copy that captures your audience’s attention and drives the desired action. Supreme AI Writer is fully integrated into Divi, allowing you to generate high-quality content quickly and accurately. With the Power of OpenAI’s ChatGPT, it can analyze complex ideas and deliver stunning results in record time.\nHow It Works?\nTo Get Started, open up any Module’s Settings that have the Content Field, where you’ll see the Supreme AI Button. Simply Click on It and you’ll see stunning new options.\n\n\nProvide AI with Essential Details\nNow in these new options, you can start generating your content. You can choose Your Writing Style, Tone and even change the Creativity of the content. Provide a small description of the content you want to enhance or AI to generate for you and then hit Generate Button!\n\nRefine Until You’re Fully Satisfied!\nAnd there you go, AI generated stunning content for you in a few seconds, isn’t that cool? And the best part, you don’t even have to go outside of Divi. And If you’re not happy with the results, click the Regenerate Button and AI will generate something new each time.\n\nDoes it include Divi Supreme Pro plugin?\nSupreme AI Writer is a separate plugin and is not the part or same as Divi Supreme Pro. Divi Supreme Focuses on providing stunning modules and features to enhance your Divi Site, while Supreme AI Writer helps you create a stunning content copy in seconds.\n\n",
      "content": "\n",
      "categories": [],
      "tags": [],
      
      "collection": "projects",
      "url": "/projects/2_supreme/"
    },{
      "image": {"path":"/assets/img/projects/02_kua.png"},
      "title": "Kua",
      "date": "2023-02-10 00:00:00 -0500",
      "description": "The Only One-Stop AI Content Generator Built for E-Commerce that Creates Premium contents (Amazon Listings, Product Photos, Social Posts, Blogs, etc)\nUnderstanding the Basics of Kua AI Tool:\n\n  Define the core objectives and functionalities of the Kua AI Tool.\n  Explain the primary areas in which Kua excels, such as data analysis, natural language processing, and image recognition.\n\n\nThree Simple Steps to Content Mastery\n\n  \n    Step 1: Select the tasks to be done\nChoose from 200+ ready-to-use applications, including Amazon Listing Builder, SEO Content Wizard, AI Image Creation, and more\n  \n  \n    Step 2: Give Kua.ai a bit of context\nEnter your product names or keywords, then choose the desired output language and tone\n  \n  \n    Step 3: Confirm the results\nKua.ai provides you with quality results that align with industry best practices. You simply need to confirm the option you prefer the most\n  \n\n\n\n\nInfobase - Create Distinctive Content with Your Unique Brand Style\n\n  \n    Add your brand information, product details, and brand voice into Infobase\n  \n  \n    Simply enter “#” to instantly use this information in any Kua.ai application or during AI chats\n  \n  \n    Say goodbye to concerns about AI-generated content being overly generic or including information that contradicts your facts\n  \n\n\n\n\nAI Image Creation 🎨 Craft Stunning Product Images Even for Beginners\n\n  \n    Text to Image:\nDescribe what you want in your own words and create the desired images instantly\n  \n  \n    Image Variation:\nQuickly generate similar-style images by uploading an existing product image\n  \n  \n    Replace Background:\nEasily change the background of a product image using preset templates or based on your specific requirements\n  \n\n\n\n",
      "content": "\n",
      "categories": [],
      "tags": [],
      
      "collection": "projects",
      "url": "/projects/02_kua/"
    },{
      "image": {"path":"/assets/img/projects/9_ocilex.gif"},
      "title": "Ocilex",
      "date": "2023-04-27 00:00:00 -0400",
      "description": "Ocilex is a platform for monitoring the construction process. It allows construction companies to control access to application features for both internal managers and external users. Managers can configure cameras and timelapse generation schedules. Users have a wide list of ways to track the building process.\nPurpose and Need\nTo meet customer needs, the app needed to provide users with timelapses of construction from multiple viewpoints as well as the ability to compare snapshots taken on different dates using side-by-side comparison, magnifier, and a comparison between the snapshot and 3D model (BIM comparison).\n\nWorkflow\nSince the main purpose of the application is to show several pages with the construction visualization, we decided to focus on this and make the UI clear and simple. Material UI components were used for this. Connecting to the cameras was a challenge, but once that was solved, adding new features became much easier. Clients were involved in the process and regularly provided us with feedback and new requirements. In addition, they covered test cameras connection, which was very helpful for us.\nTechnology\n\n  \n    To accomplish all this, we used React.js with the MaterialUI framework. And for the backend, we selected the Apollo server and Node.js + TypeScript combination.\n  \n  \n    The entire application is deployed to the DigitalOcean App Platform and complimented by static checking and quality control in the GitLab CI.\n  \n\n\nStructure and Features\n\n  \n    LIVE VIEW\n  \n  \n  \n    SNAPSHOT EDITOR\n  If users want to highlight something they notice on a snapshot, they can draw, add notes, and upload the result.\n  \n  \n\n\nTimelapse\n\n  For those who want to see something come from nothing, we provide a timelapse video feature that allows you to see new buildings grow from the very beginning to the opening. For each site, administrators set the camera, working days, and schedule for adding snapshots to videos.\n\n\n\nSnapshots Comparison\nAnd for those who would like to see progress over an exact period of time, Ocilex allows to compare snapshots taken on different dates, either through side-by-side comparison or using a magnifier detailed view from one snapshot over the another.\n\n\n\nBIM Comparison\nFor users who want to see the difference between the initial design and the final building, there is also a BIM Comparison feature that allows you to compare timelapse or camera images and a 3D model of the building.\n\nCamera Health Notification\nOcilex provides administrators with helpful notifications when cameras stop responding, including full details about the issue.\n\nResults\nThe MVP was successfully launched in 2022. We’ve added several more features and improvements in 2023 to enhance the admin and customer experience.\n",
      "content": "\n",
      "categories": [],
      "tags": [],
      
      "collection": "projects",
      "url": "/projects/9_ocilex/"
    },{
      "image": {"path":"/assets/img/projects/01_swashapp.png"},
      "title": "Swash",
      "date": "2023-05-12 00:00:00 -0400",
      "description": "Swash powers Shopify storefronts with nocode store blocks on auto-pilot. Power up with one-click 📈sale+stock automations, convert better with 🛍️product guides &amp; how-to’s, and deliver real-time price &amp; 🛒bestseller updates with badges.\nOverview\nSwash enables internet users, developers, and businesses to cultivate new realities of data ownership and value creation through new incentivisation streams, innovative data monetisation mechanisms, and a collaborative development framework, governed by the ethos of Web 3.\nWhile we browse the internet every day, our data is being captured and monetized without our benefit or consent. It can be complicated to understand what data is being used for what purpose, and the road for the average person browsing the web to take back control has been unclear.\n\n\n  The business model of Internet 2.0 was free products, paid for by capturing user behaviour and personal data, often in ways users did not expect. Streamr’s addition to the Web 3 model allows for the creation of Data Unions — ad hoc collectives of users pooling their data to in order to increase its value and then selling subscriptions to it.\n  Our team has built the first of these, a browser extension called Swash, that was first introduced at Mozfest in London in late 2019. Swash allows users to capture their browsing data, gives them tools to hide anything sensitive, and then send it in real-time to Streamr Network.\n  \n    Behind the scenes, the Streamr stack works with the xDai sidechain to enable potentially hundreds of thousands of data providers to withdraw payments for their data from the single Ethereum smart contract that powers each Data Union. This was a world first, the first digital data union ever created.\n\n    \n      An easy to use pub/sub network, world-class UI/UX, and a transparent and highly skilled team.\n    \n  \n\n\n\nPurpose and Need\n\n  \n    People lack ownership over their data and don’t receive any value from it, businesses pay for expensive, low-quality data that lacks consent, and developers struggle to build due to lack of access to high-quality data.\n  \n  \n    We live in a world governed by data. A transparent, secure, and collaborative ecosystem that incentivises everyone - without compromising on security and innovation - is urgently needed.\n  \n  \n    Swash’s decentralised data ecosystem redefines how data is collected and valued by providing a simple way to passively earn, innovate, and create for a fairer world and better, more equitable internet.\n  \n\n\n\n\nHere’s how it works:\n\n  \n    Data Ownership: Swash users have complete control over their data. They can choose to share specific data points or opt-out entirely. This means users can decide what data is valuable and what remains private.\n  \n  \n    Data Monetization: Users earn Swash Tokens (SWT) by selling their data to businesses and researchers. This creates a win-win situation where users are compensated for their data while companies gain access to high-quality, consent-based data.\n  \n  \n    Data Privacy: Swash is designed with robust privacy safeguards. All data transactions are encrypted and anonymized, ensuring user anonymity and data security. The platform complies with strict GDPR and privacy regulations.\n  \n  \n    Data Utility: Swash encourages data-driven research and development. Researchers and organizations can access valuable datasets for various purposes, such as market analysis, trend forecasting, and scientific research.\n  \n\n\n\n\nWhy Swash Matters\nSwash addresses several key issues related to data ownership, privacy, and the data economy:\n\n\n  \n    Empowering Individuals: Swash puts the power back into the hands of users. It allows individuals to make informed decisions about their data and benefit financially from it.\n  \n  \n    Data Privacy: Swash’s emphasis on data privacy ensures that users have full control over their information. With end-to-end encryption and anonymization, users can trust their data is handled with the utmost care.\n  \n  \n    Fair Compensation: Swash rewards users for their data, creating a fair compensation model that ensures users are not exploited for their valuable information.\n  \n  \n    Ethical Data Collection: Swash promotes ethical data collection practices, enabling companies to access data in a way that respects user consent and privacy.\n  \n  \n    Data for Good: The platform opens up opportunities for research and social good, allowing organizations to access user data for purposes that benefit society.\n  \n\n\n\n\nRelated  Posts\n\n  EU Gets Serious About Data, Cites Web3 Browser Extension Swash\n  Mapping the landscape of data intermediaries\n  Swash Earn Goes Live!\n  How to: Donate your $SWASH via Data for Good\n  How to: Earn more with Swash Ads\n\n\nThe Benefits of a Tokenized Data Union\n\n  \n    A data union is a framework that allows people to band together and reclaim the value of their information. By rewarding users through the $SWASH token, they are not only paid as they browse the web, but also will see their earnings increase in value as the network grows and the token appreciates over time. This type of network effect is enabled by Web 3 tokenization, and is what Swash had in mind when they decided to focus on their ideological mission of monetizing user data at their outset, rather than first trying to grow the marketplace. By rewarding the community for its growth, the structure of the union becomes truly for the people, by the people.\n  \n  \n    Though there are existing Web 2 services that allow users to approve their data sales and profit from them, Swash’s passive income structure facilitates easy onboarding of the average consumer. The Swash extension can be installed into multiple browsers with the same account, providing seamless benefits across all of a user’s internet activity. As Swash grows its data union to encompass a wide range of users and builders, revolutionary dApps will continuously be created that connect data creators and buyers in productive ways. By creating a transparent bond between all sides of the data purchasing equation, Swash aims to become the leader in selling data that is relevant and valuable. As the company achieves its goals, the value of the $SWASH token subsequently rises, providing larger rewards to its holders.\n  \n  \n    Under the Swash model, users install a browser extension for their chosen browser — Chrome, Firefox, Brave and Edge so far. Setup involves deciding which sites to never record data for, and how much data you’re comfortable with sharing. Then turn Swash on and browse as normal. The data is streamed to a Data Union where it is available for purchase. Revenue is distributed equally and members can choose when to withdraw funds to their own wallets. As a Data Union Admin, Swash takes a small percentage of all sales.\n  \n\n\nNext Steps for Swash\n\n  \n    Having first proven the concept of allowing users to monetize their data in a decentralized manner, Swash set out to grow the community and provide additional use cases for the protocol.  2021 was a huge year for Swash as they became the world’s largest data union, proving the success of their mission-based approach. They held a successful IDO of the $SWASH token at the end of October, subsequently expanding their team.\n  \n  \n    Understanding the importance of interoperability, Swash has prioritized creating new integrations that allow the protocol to work with additional blockchains, and partnered with collaborators to provide additional flexibility and utility. They have also integrated burn mechanisms into Sash that will reward the community and facilitate tokenomic sustainability as they launch the Swash DAO, which will give holders a voice in decisions related to the company and token.\n  \n  \n    Moving forward, Swash plans to launch a suite of services to enable builders to innovate on their protocol, including sCompute, sChannel, and sApps. Having laid a strong foundation as the leaders in this new, revolutionary field of decentralized data collection, these next iterations will serve to expand their reach and provide the possibility of a true partnership between data creators and buyers. As consumers become more aware of the economics behind their internet usage, Swash provides a powerful way for us to reclaim our power, bringing new users into the open metaverse in the process.\n  \n\n",
      "content": "\n",
      "categories": [],
      "tags": [],
      
      "collection": "projects",
      "url": "/projects/01_swashapp/"
    }
  ]
}

